Repository: zhenchuanpk2010/PDFMathTranslator
Catalog: docs/Contribute/*.po
Languages: es

# chunk_EE74991B
source: Community leaders are responsible for clarifying and enforcing our standards of acceptable behavior and will take appropriate and fair corrective action in response to any behavior that they deem inappropriate, threatening, offensive, or harmful. Community leaders have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, and will communicate reasons for moderation decisions when appropriate.
es: Los líderes de la comunidad son responsables de aclarar y hacer cumplir nuestros estándares de comportamiento aceptable y tomarán medidas correctivas apropiadas y justas en respuesta a cualquier comportamiento que consideren inapropiado, amenazante, ofensivo o dañino. Los líderes de la comunidad tienen el derecho y la responsabilidad de eliminar, editar o rechazar comentarios, commits, código, ediciones de wiki, problemas y otras contribuciones que no estén alineadas con este Código de Conducta, y comunicarán las razones de las decisiones de moderación cuando sea apropiado.

# chunk_EC6E1121
source: ## Scope
es: ## Alcance

# chunk_C8A3DB27
source: This Code of Conduct applies within all community spaces, and also applies when an individual is officially representing the community in public spaces. Examples of representing our community include using an official e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event.
es: Este Código de Conducta se aplica dentro de todos los espacios de la comunidad, y también se aplica cuando un individuo representa oficialmente a la comunidad en espacios públicos. Ejemplos de representar a nuestra comunidad incluyen el uso de una dirección de correo electrónico oficial, publicaciones a través de una cuenta oficial de redes sociales, o actuar como representante designado en un evento en línea o fuera de línea.

# chunk_B7BB8282
source: ## Enforcement
es: ## Aplicación

# chunk_BBB24E28
source: Instances of abusive, harassing, or otherwise unacceptable behavior may be reported to the community leaders responsible for enforcement at `aw@funstory.ai` . All complaints will be reviewed and investigated promptly and fairly. All community leaders are obligated to respect the privacy and security of the reporter of any incident.
es: Los casos de comportamiento abusivo, acosador o inaceptable pueden ser reportados a los líderes de la comunidad responsables de la aplicación en `aw@funstory.ai`. Todas las quejas serán revisadas e investigadas de manera rápida y justa. Todos los líderes de la comunidad están obligados a respetar la privacidad y seguridad del denunciante de cualquier incidente.

# chunk_917146E0
source: ## Enforcement Guidelines
es: ## Directrices de aplicación

# chunk_40C51FE2
source: Community leaders will follow these Community Impact Guidelines in determining the consequences for any action they deem in violation of this Code of Conduct:
es: Los líderes de la comunidad seguirán estas Pautas de Impacto en la Comunidad para determinar las consecuencias de cualquier acción que consideren en violación de este Código de Conducta:

# chunk_7DC402F6
source: ### 1. Correction
es: ### 1. Corrección

# chunk_589DD968
source: **Community Impact**: Use of inappropriate language or other behavior deemed unprofessional or unwelcome in the community. **Consequence**: A private, written warning from community leaders, providing clarity around the nature of the violation and an explanation of why the behavior was inappropriate. A public apology may be requested.
es: **Impacto en la Comunidad**: Uso de lenguaje inapropiado u otro comportamiento considerado poco profesional o no deseado en la comunidad. **Consecuencia**: Una advertencia privada y escrita por parte de los líderes de la comunidad, proporcionando claridad sobre la naturaleza de la violación y una explicación de por qué el comportamiento fue inapropiado. Se puede solicitar una disculpa pública.

# chunk_4AE59666
source: ### 2. Warning
es: ### 2. Advertencia

# chunk_8645DDC9
source: **Community Impact**: A violation through a single incident or series of actions. **Consequence**: A warning with consequences for continued behavior. No interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, for a specified period of time. This includes avoiding interactions in community spaces as well as external channels like social media. Violating these terms may lead to a temporary or permanent ban.
es: **Impacto en la Comunidad**: Una violación a través de un incidente único o una serie de acciones. **Consecuencia**: Una advertencia con consecuencias por comportamiento continuado. Sin interacción con las personas involucradas, incluyendo interacción no solicitada con aquellos que hacen cumplir el Código de Conducta, por un período de tiempo especificado. Esto incluye evitar interacciones en espacios comunitarios así como en canales externos como redes sociales. Violar estos términos puede llevar a una prohibición temporal o permanente.

# chunk_357EC7B7
source: ### 3. Temporary Ban
es: ### 3. Prohibición temporal

# chunk_855D5A2A
source: **Community Impact**: A serious violation of community standards, including sustained inappropriate behavior. **Consequence**: A temporary ban from any sort of interaction or public communication with the community for a specified period of time. No public or private interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, is allowed during this period. Violating these terms may lead to a permanent ban.
es: **Impacto en la comunidad**: Una violación grave de los estándares de la comunidad, incluyendo comportamiento inapropiado sostenido. **Consecuencia**: Una prohibición temporal de cualquier tipo de interacción o comunicación pública con la comunidad por un período de tiempo especificado. No se permite ninguna interacción pública o privada con las personas involucradas, incluyendo interacción no solicitada con aquellos que hacen cumplir el Código de Conducta, durante este período. Violar estos términos puede llevar a una prohibición permanente.

# chunk_7C7DB2B5
source: ### 4. Permanent Ban
es: ### 4. Prohibición permanente

# chunk_FAF381FA
source: **Community Impact**: Demonstrating a pattern of violation of community standards, including sustained inappropriate behavior, harassment of an individual, or aggression toward or disparagement of classes of individuals. **Consequence**: A permanent ban from any sort of public interaction within the community.
es: **Impacto en la comunidad**: Demostrar un patrón de violación de los estándares de la comunidad, incluyendo comportamiento inapropiado sostenido, acoso a un individuo, o agresión o menosprecio hacia clases de individuos. **Consecuencia**: Una prohibición permanente de cualquier tipo de interacción pública dentro de la comunidad.

# chunk_5C710B75
source: ## Attribution
es: ## Atribución

# chunk_994E96A8
source: This Code of Conduct is adapted from the [Contributor Covenant][homepage], version 2.0, available at https://www.contributor-covenant.org/version/2/0/code_of_conduct.html. Community Impact Guidelines were inspired by [Mozilla's code of conduct enforcement ladder](https://github.com/mozilla/diversity). [homepage]: https://www.contributor-covenant.org For answers to common questions about this code of conduct, see the FAQ at https://www.contributor-covenant.org/faq. Translations are available at https://www.contributor-covenant.org/translations.
es: Este Código de Conducta está adaptado del [Contributor Covenant][homepage], versión 2.0, disponible en https://www.contributor-covenant.org/version/2/0/code_of_conduct.html. Las Pautas de Impacto en la Comunidad se inspiraron en [la escalera de aplicación del código de conducta de Mozilla](https://github.com/mozilla/diversity). [homepage]: https://www.contributor-covenant.org Para respuestas a preguntas comunes sobre este código de conducta, consulta las Preguntas frecuentes en https://www.contributor-covenant.org/faq. Las traducciones están disponibles en https://www.contributor-covenant.org/translations.

# chunk_BBFC419C
source: Some questions are frequently asked, so we have provided a list for users who encounter similar issues.
es: Algunas preguntas se hacen con frecuencia, por lo que hemos proporcionado una lista para los usuarios que encuentren problemas similares.

# chunk_2B5D23E7
source: ## Is a GPU required?
es: ## ¿Se requiere una GPU?

# chunk_A85F81AE
source: - **Question**:
es: - **Pregunta**:

# chunk_8E573398
source: As the program uses artificial intelligence to recognize and extract documents, is GPU required?
es: ¿El programa utiliza inteligencia artificial para reconocer y extraer documentos, se requiere una GPU?

# chunk_FE846FC9
source: - **Answer**:
es: - **Respuesta**:

# chunk_63C892F6
source: **GPU is not required.** But if you have a GPU, the program will automatically use it for higher performance.
es: **No se requiere una GPU.** Pero si tienes una GPU, el programa la usará automáticamente para un mayor rendimiento.

# chunk_610DD2DC
source: ## Downloading interrupted?
es: ## ¿Descarga interrumpida?

# chunk_53B66922
source: I encountered the following interrupt error while downloading the model. What should I do?
es: Encontré el siguiente error de interrupción mientras descargaba el modelo. ¿Qué debo hacer?

# chunk_2A133C40
source: The network is receiving interference, please use a stable network link or try to bypass network intervention.
es: La red está recibiendo interferencias, por favor usa un enlace de red estable o intenta evitar la intervención de la red.

# chunk_ABB33668
source: ## How to update to the latest version?
es: ## ¿Cómo actualizar a la última versión?

# chunk_981A22AF
source: I want to use some of the features of the latest version, how do I update it?
es: Quiero usar algunas de las funciones de la última versión, ¿cómo la actualizo?

# chunk_9FB0E3EA
source: ## The following files do not exist: example.pdf
es: ## Los siguientes archivos no existen: example.pdf

# chunk_22B1E6C4
source: - **Issue**:
es: - **Problema**:

# chunk_FAB807CC
source: When executing the program, users would have the following outputs: `The following files do not exist: example.pdf` if the document was not found.
es: Al ejecutar el programa, los usuarios tendrían las siguientes salidas: `Los siguientes archivos no existen: example.pdf` si el documento no se encontró.

# chunk_E7371FD6
source: - **Solution**: - Open the command line in the directory where the file is located, or - Enter the full path of the file directly after pdf2zh, or - Use the interactive mode `pdf2zh -i` to drag and drop files directly
es: - **Solución**: - Abre la línea de comandos en el directorio donde se encuentra el archivo, o - Ingresa la ruta completa del archivo directamente después de pdf2zh, o - Usa el modo interactivo `pdf2zh -i` para arrastrar y soltar archivos directamente

# chunk_F523458B
source: ## SSL Error and Other Network Issues
es: ## Error SSL y otros problemas de red

# chunk_DF99BBC1
source: When downloading hugging face models, users in China may get network error. For example, in [issue #55](https://github.com/PDFMathTranslate/PDFMathTranslate-next/issues/55), [#70](https://github.com/PDFMathTranslate/PDFMathTranslate-next/issues/70).
es: Al descargar modelos de hugging face, los usuarios en China pueden experimentar errores de red. Por ejemplo, en [issue #55](https://github.com/PDFMathTranslate/PDFMathTranslate-next/issues/55), [#70](https://github.com/PDFMathTranslate/PDFMathTranslate-next/issues/70).

# chunk_AC4D20E5
source: - **Solution**: - [Bypass GFW](https://github.com/clash-verge-rev/clash-verge-rev). - [Use Hugging Face Mirror](https://hf-mirror.com/). - [Use Portable version](https://github.com/PDFMathTranslate/PDFMathTranslate-next?tab=readme-ov-file#method-ii-portable). - [Use Docker instead](https://github.com/PDFMathTranslate/PDFMathTranslate-next#docker). - [Update Certificates](https://stackoverflow.com/questions/51925384/unable-to-get-local-issuer-certificate-when-using-requests), as suggested in [issue #55](https://github.com/PDFMathTranslate/PDFMathTranslate-next/issues/55).
es: - **Solución**: - [Bypass GFW](https://github.com/clash-verge-rev/clash-verge-rev). - [Usar espejo de Hugging Face](https://hf-mirror.com/). - [Usar versión portable](https://github.com/PDFMathTranslate/PDFMathTranslate-next?tab=readme-ov-file#method-ii-portable). - [Usar Docker en su lugar](https://github.com/PDFMathTranslate/PDFMathTranslate-next#docker). - [Actualizar certificados](https://stackoverflow.com/questions/51925384/unable-to-get-local-issuer-certificate-when-using-requests), como se sugiere en [issue #55](https://github.com/PDFMathTranslate/PDFMathTranslate-next/issues/55).

# chunk_8AA448AC
source: ## Localhost is not accessible
es: ## Localhost no es accesible

# chunk_4E814B7B
source: Please see below.
es: Por favor, vea a continuación.

# chunk_EA897629
source: ## Error launching GUI using 0.0.0.0
es: ## Error al iniciar la GUI usando 0.0.0.0

# chunk_D65A22CE
source: Using proxy software in global mode may prevent Gradio from starting properly. For example, in [issue #77](https://github.com/PDFMathTranslate/PDFMathTranslate-next/issues/77).
es: El uso de software de proxy en modo global puede impedir que Gradio se inicie correctamente. Por ejemplo, en [issue #77](https://github.com/PDFMathTranslate/PDFMathTranslate-next/issues/77).

# chunk_587F7FBA
source: - **Solution**:
es: - **Solución**:

# chunk_E7C819A4
source: Use rule mode
es: Modo de uso de reglas

# chunk_9221A870
source: [**Advanced**](./introduction.md) > **Documentation of Translation Services** _(current)_
es: [**Opciones avanzadas**](./introduction.md) > **Documentación de servicios de traducción** _(actual)_

# chunk_7775DA81
source: ### Viewing Available Translate Services via Command Line
es: ### Visualización de servicios de traducción disponibles mediante la Línea de comandos

# chunk_4919DFD2
source: You can confirm the available translate services and their usage by printing the help message in the command line.
es: Puedes confirmar los servicios de traducción disponibles y su uso imprimiendo el mensaje de ayuda en la línea de comandos.

# chunk_7935E690
source: At the end of the help message, you can view detailed information about the different translation services.
es: Al final del mensaje de ayuda, puedes ver información detallada sobre los diferentes servicios de traducción.

# chunk_0D65A508
source: [**Advanced**](./introduction.md) > **Language Code** _(current)_
es: [**Opciones avanzadas**](./introduction.md) > **Código de idioma** _(actual)_

# chunk_C036D2E5
source: Source <https://developers.google.com/admin-sdk/directory/v1/languages?hl=zh-cn>, organized by GPT-4o.
es: Fuente <https://developers.google.com/admin-sdk/directory/v1/languages?hl=zh-cn>, organizado por GPT-4o.

# chunk_89056507
source: | Label in Chinese | Label | `Language Code` | | --- | --- | --- | | 阿姆哈拉语 | Amharic | `am` |
es: | Etiqueta en español | Etiqueta | `Language Code` | | --- | --- | --- | | Amárico | Amharic | `am` |

# chunk_434D3480
source: | 阿拉伯语 | Arabic | `ar` |
es: | Árabe | Arabic | `ar` |

# chunk_4E045D6E
source: | 巴斯克语 | Basque | `eu` |
es: | Euskara | Basque | `eu` |

# chunk_8BDA075A
source: | 孟加拉语 | Bengali | `bn` |
es: | Bengalí | Bengali | `bn` |

# chunk_2B8A2E4A
source: | 英语（英国） | English (UK) | `en-GB` |
es: | Inglés (Reino Unido) | English (UK) | `en-GB` |

# chunk_10CEEC80
source: | 葡萄牙语（巴西） | Portuguese (Brazil) | `pt-BR` |
es: | Português (Brasil) | Portuguese (Brazil) | `pt-BR` |

# chunk_40F26E94
source: | 保加利亚语 | Bulgarian | `bg` |
es: | Búlgaro | Bulgarian | `bg` |

# chunk_BAC1D2DD
source: | 加泰罗尼亚语 | Catalan | `ca` |
es: | Catalán | Catalan | `ca` |

# chunk_D8283F5F
source: | 切罗基语 | Cherokee | `chr` |
es: | Cherokee | Cherokee | `chr` |

# chunk_6C504077
source: | 克罗地亚语 | Croatian | `hr` |
es: | Croata | Croatian | `hr` |

# chunk_EF7519DD
source: | 捷克语 | Czech | `cs` |
es: | Checo | Czech | `cs` |

# chunk_52641096
source: | 丹麦语 | Danish | `da` |
es: | Danés | Danish | `da` |

# chunk_22A8086F
source: | 荷兰语 | Dutch | `nl` |
es: | Español | Spanish | `es` |

# chunk_534B2AA9
source: | 英语（美国） | English (US) | `en` |
es: | Español (España) | Spanish (Spain) | `es` |

# chunk_5B49CFFF
source: | 爱沙尼亚语 | Estonian | `et` |
es: | Estonio | Estonian | `et` |

# chunk_F3BE0662
source: | 菲律宾语 | Filipino | `fil` |
es: | Filipino | Filipino | `fil` |

# chunk_AB091AA3
source: | 芬兰语 | Finnish | `fi` |
es: | Finés | Finnish | `fi` |

# chunk_E9126CEE
source: | 法语 | French | `fr` |
es: | Francés | French | `fr` |

# chunk_6A475C12
source: | 德语 | German | `de` |
es: | Alemán | `de` |

# chunk_63D84713
source: | 希腊语 | Greek | `el` |
es: | Griego | Greek | `el` |

# chunk_A6DD638F
source: | 古吉拉特语 | Gujarati | `gu` |
es: | Gujarati | Gujarati | `gu` |

# chunk_B85F863E
source: | 希伯来语 | Hebrew | `iw` |
es: | Hebreo | Hebrew | `iw` |

# chunk_108CDAD2
source: | 印地语 | Hindi | `hi` |
es: | Hindi | Hindi | `hi` |

# chunk_371C85CF
source: | 匈牙利语 | Hungarian | `hu` |
es: | Húngaro | Hungarian | `hu` |

# chunk_DFA87215
source: | 冰岛语 | Icelandic | `is` |
es: | Islandés | Icelandic | `is` |

# chunk_77057FC2
source: | 印度尼西亚语 | Indonesian | `id` |
es: | Indonesio | Indonesian | `id` |

# chunk_FF3C4126
source: | 意大利语 | Italian | `it` |
es: | Italiano | Italian | `it` |

# chunk_652E29EB
source: | 日语 | Japanese | `ja` |
es: | Japonés | `ja` |

# chunk_93927FAF
source: | 卡纳达语 | Kannada | `kn` |
es: | Kannada | `kn` |

# chunk_F96E1E17
source: | 拉脱维亚语 | Latvian | `lv` |
es: | Letón | Letón | `lv` |

# chunk_55EC6BB8
source: | 立陶宛语 | Lithuanian | `lt` |
es: | Lituano | Lithuanian | `lt` |

# chunk_D4EE46C1
source: | 马来语 | Malay | `ms` |
es: | Malayo | Malay | `ms` |

# chunk_81884171
source: | 马拉雅拉姆语 | Malayalam | `ml` |
es: | Malayalam | Malayalam | `ml` |

# chunk_2560880A
source: | 马拉地语 | Marathi | `mr` |
es: | Marathi | Marathi | `mr` |

# chunk_7EBAF4DE
source: | 波兰语 | Polish | `pl` |
es: | Polaco | Polish | `pl` |

# chunk_07BEC358
source: | 葡萄牙语（葡萄牙） | Portuguese (Portugal) | `pt-PT` |
es: | Portugués (Portugal) | Portugués (Portugal) | `pt-PT` |

# chunk_0A7A2233
source: | 罗马尼亚语 | Romanian | `ro` |
es: | Rumano | Romanian | `ro` |

# chunk_AD2D309D
source: | 俄语 | Russian | `ru` |
es: | Ruso | Russian | `ru` |

# chunk_9BA57E97
source: | 塞尔维亚语 | Serbian | `sr` |
es: | Serbio | Serbian | `sr` |

# chunk_9240CC91
source: | 中文（中国） | Chinese (PRC) | `zh-CN` |
es: | Español (España) | Spanish (Spain) | `es-ES` |

# chunk_A2F7B475
source: | 斯洛伐克语 | Slovak | `sk` |
es: | Eslovaco | Slovak | `sk` |

# chunk_4188ADDD
source: | 斯洛文尼亚语 | Slovenian | `sl` |
es: | Esloveno | Slovenian | `sl` |

# chunk_E4F70BC1
source: | 西班牙语 | Spanish | `es` |
es: | Español | Spanish | `es` |

# chunk_5DCBD4C6
source: | 瑞典语 | Swedish | `sv` |
es: | Sueco | Swedish | `sv` |

# chunk_A604BFF4
source: | 泰米尔语 | Tamil | `ta` |
es: | Tamil | Tamil | `ta` |

# chunk_7E308345
source: | 泰卢固语 | Telugu | `te` |
es: | Telugu | Telugu | `te` |

# chunk_B766F3D4
source: | 泰语 | Thai | `th` |
es: | Tailandés | Thai | `th` |

# chunk_C1B06A67
source: | 中文（台湾） | Chinese (Taiwan) | `zh-TW` |
es: | Español (España) | Spanish (Spain) | `es-ES` |

# chunk_1B069A9E
source: | 乌尔都语 | Urdu | `ur` |
es: | Urdu | Urdu | `ur` |

# chunk_906AD05C
source: | 乌克兰语 | Ukrainian | `uk` |
es: | Ucraniano | Ukrainian | `uk` |

# chunk_CADB0DBE
source: | 威尔士语 | Welsh | `cy` |
es: | Galés | Welsh | `cy` |

# chunk_CD419A2D
source: Source <https://developers.deepl.com/docs/resources/supported-languages>, organized by GPT-4o.
es: Fuente <https://developers.deepl.com/docs/resources/supported-languages>, organizado por GPT-4o.

# chunk_73C925CB
source: | Label in Chinese | Label | `Language Code`| Supports | | --- | --- | --- | --- | | 阿拉伯语 | Arabic | `AR` | `source`, `target` |
es: | Etiqueta en español | Etiqueta | `Language Code` | Soporta | | --- | --- | --- | --- | | Árabe | Arabic | `AR` | `source`, `target` |

# chunk_449EF659
source: | 保加利亚语 | Bulgarian | `BG` | `source`, `target` |
es: | Búlgaro | Bulgarian | `BG` | `source`, `target` |

# chunk_F1AC6529
source: | 捷克语 | Czech | `CS` | `source`, `target` |
es: | Checo | Czech | `CS` | `source`, `target` |

# chunk_499838A9
source: | 丹麦语 | Danish | `DA` | `source`, `target` |
es: | Danés | Danish | `DA` | `source`, `target` |

# chunk_6E7A86D5
source: | 德语 | German | `DE` | `source`, `target` |
es: | Español | Spanish | `ES` | `source`, `target` |

# chunk_11DB586F
source: | 希腊语 | Greek | `EL` | `source`, `target` |
es: | Griego | Greek | `EL` | `source`, `target` |

# chunk_B38960C2
source: | 英语 | English | `EN` | `source`, `target` |
es: | Español | `ES` | `source`, `target` |

# chunk_04ACBE3E
source: | 英语（英国） | English (British) | `EN-GB` | `target` |
es: | Español (España) | Spanish (Spain) | `ES-ES` | `target` |

# chunk_B4390A6E
source: | 西班牙语 | Spanish | `ES` | `source`, `target` |
es: | Español | Spanish | `ES` | `source`, `target` |

# chunk_BB651F90
source: | 爱沙尼亚语 | Estonian | `ET` | `source`, `target` |
es: | Estonio | Estonian | `ET` | `source`, `target` |

# chunk_8C2548A1
source: | 芬兰语 | Finnish | `FI` | `source`, `target` |
es: | Finés | Finnish | `FI` | `source`, `target` |

# chunk_9D18F62B
source: | 法语 | French | `FR` | `source`, `target` |
es: | Francés | French | `FR` | `source`, `target` |

# chunk_9E56C34E
source: | 匈牙利语 | Hungarian | `HU` | `source`, `target` |
es: | Húngaro | Hungarian | `HU` | `source`, `target` |

# chunk_B22D2080
source: | 印度尼西亚语 | Indonesian | `ID` | `source`, `target` |
es: | Indonesio | Indonesian | `ID` | `source`, `target` |

# chunk_4033F9B6
source: | 意大利语 | Italian | `IT` | `source`, `target` |
es: | Italiano | Italian | `IT` | `source`, `target` |

# chunk_69D4C3F5
source: | 日语 | Japanese | `JA` | `source`, `target` |
es: | Japonés | `JA` | `source`, `target` |

# chunk_D3B9AFD6
source: | 韩语 | Korean | `KO` | `source`, `target` |
es: | Español | `ES` | `source`, `target` |

# chunk_82B11E30
source: | 立陶宛语 | Lithuanian | `LT` | `source`, `target` |
es: | Lituano | Lithuanian | `LT` | `source`, `target` |

# chunk_8EE65B58
source: | 拉脱维亚语 | Latvian | `LV` | `source`, `target` |
es: | Letón | Latvian | `LV` | `source`, `target` |

# chunk_BE638C29
source: | 挪威博克马尔语 | Norwegian Bokmål | `NB` | `source`, `target` |
es: | Noruego Bokmål | Norwegian Bokmål | `NB` | `source`, `target` |

# chunk_6A6B98E7
source: | 荷兰语 | Dutch | `NL` | `source`, `target` |
es: | Español | Dutch | `NL` | `source`, `target` |

# chunk_830AFF98
source: | 波兰语 | Polish | `PL` | `source`, `target` |
es: | Polaco | Polish | `PL` | `source`, `target` |

# chunk_49AAA50E
source: | 葡萄牙语 | Portuguese | `PT` | `source`, `target` |
es: | Portugués | Portuguese | `PT` | `source`, `target` |

# chunk_FF12E792
source: | 葡萄牙语（巴西） | Portuguese (Brazilian) | `PT-BR` | `target` |
es: | Portugués (Brasil) | Portuguese (Brazilian) | `PT-BR` | `target` |

# chunk_7E188EC0
source: | 葡萄牙语（欧洲） | Portuguese (European) | `PT-PT` | `target` |
es: | Português (Europeu) | Português (Europeu) | `PT-PT` | `target` |

# chunk_557425BD
source: | 罗马尼亚语 | Romanian | `RO` | `source`, `target` |
es: | Rumano | Romanian | `RO` | `source`, `target` |

# chunk_0FBF4463
source: | 俄语 | Russian | `RU` | `source`, `target` |
es: | Ruso | Russian | `RU` | `source`, `target` |

# chunk_11FAA384
source: | 斯洛伐克语 | Slovak | `SK` | `source`, `target` |
es: | Eslovaco | Slovak | `SK` | `source`, `target` |

# chunk_117E9013
source: | 斯洛文尼亚语 | Slovenian | `SL` | `source`, `target` |
es: | Esloveno | Slovenian | `SL` | `source`, `target` |
