Repository: zhenchuanpk2010/PDFMathTranslator
Catalog: docs/Contribute/*.po
Languages: es

# chunk_EF0CF035
source: | 瑞典语 | Swedish | `SV` | `source`, `target` |
es: | Sueco | Swedish | `SV` | `source`, `target` |

# chunk_41772AFF
source: | 土耳其语 | Turkish | `TR` | `source`, `target` |
es: | Turco | Turkish | `TR` | `source`, `target` |

# chunk_95BAEB3E
source: | 乌克兰语 | Ukrainian | `UK` | `source`, `target` |
es: | Ucraniano | Ukrainian | `UK` | `source`, `target` |

# chunk_DED8F856
source: | 中文 | Chinese | `ZH` | `source`, `target` |
es: | Español | Spanish | `ES` | `source`, `target` |

# chunk_357772FB
source: | 中文（繁体） | Chinese (Traditional) | `ZH-HANT` | `target` |
es: | Chino (tradicional) | Chinese (Traditional) | `ZH-HANT` | `target` |

# chunk_5EFF4D9F
source: ## Free Translation Service
es: ## Servicio de traducción gratuito

# chunk_3C2A41A9
source: [SiliconFlow](https://siliconflow.cn) provides free translation service for this project. Currently, the free translation service will use `THUDM/GLM-4-9B-0414` model.
es: [SiliconFlow](https://siliconflow.cn) proporciona un servicio de traducción gratuito para este proyecto. Actualmente, el servicio de traducción gratuito utilizará el modelo `THUDM/GLM-4-9B-0414`.

# chunk_0ACD2D6C
source: 1. Select "SiliconFlowFree" from the "Translation Options" - "Service" dropdown list. 2. Click the Translate button at the bottom of the page to start translation. 3. After translation is complete, you can find the translated PDF file in the "Translated" section at the bottom of the page.
es: 1. Selecciona "SiliconFlowFree" de la lista desplegable "Opciones de traducción" - "Servicio". 2. Haz clic en el botón Traducir en la parte inferior de la página para comenzar la traducción. 3. Una vez completada la traducción, puedes encontrar el archivo PDF traducido en la sección "Traducido" en la parte inferior de la página.

# chunk_24653E80
source: ### Privacy Policy
es: ### Política de privacidad

# chunk_E40E083F
source: The file content will be sent to the server of the project maintainer [@awwaawwa](https://github.com/awwaawwa), and then forwarded to SiliconFlow for translation. The maintainers of this project will only collect error information returned by SiliconFlow for debugging related services. Your file content will not be collected. SiliconFlow Privacy Policy: [简体中文](https://docs.siliconflow.cn/cn/legals/privacy-policy)/[English](https://docs.siliconflow.cn/en/legals/privacy-policy)
es: El contenido del archivo se enviará al servidor del mantenedor del proyecto [@awwaawwa](https://github.com/awwaawwa), y luego se reenviará a SiliconFlow para su traducción. Los mantenedores de este proyecto solo recopilarán información de error devuelta por SiliconFlow para depurar los servicios relacionados. No se recopilará el contenido de su archivo. Política de privacidad de SiliconFlow: [简体中文](https://docs.siliconflow.cn/cn/legals/privacy-policy)/[English](https://docs.siliconflow.cn/en/legals/privacy-policy)

# chunk_86238772
source: ## Use other models from SiliconFlow
es: ## Usar otros modelos de SiliconFlow

# chunk_6C8B20F2
source: [SiliconFlow](https://siliconflow.cn) also provides other models for translation.
es: [SiliconFlow](https://siliconflow.cn) también proporciona otros modelos para traducción.

# chunk_71BE5099
source: 1. Register an account at [SiliconFlow](https://siliconflow.cn) 2. Create an API key at [SiliconFlow API Key](https://cloud.siliconflow.cn/me/account/ak). Then, click on the key to copy it.
es: 1. Registra una cuenta en [SiliconFlow](https://siliconflow.cn) 2. Crea una clave de API en [SiliconFlow API Key](https://cloud.siliconflow.cn/me/account/ak). Luego, haz clic en la clave para copiarla.

# chunk_22AE44AB
source: 1. "Translation Options" - **"Service"** dropdown list: Select "SiliconFlow" 2. "Translation Options" - **"Base URL for SiliconFlow API"**: Keep default 3. "Translation Options" - **"SiliconFlow model to use"**: Enter "Pro/deepseek-ai/DeepSeek-V3" or other models 4. "Translation Options" - **"API key for SiliconFlow service"**: Paste your API key 5. Click the Translate button at the bottom of the page to start translation 6. After translation is complete, you can find the translated PDF file in the "Translated" section at the bottom of the page.
es: 1. "Opciones de traducción" - Lista desplegable **"Servicio"**: Selecciona "SiliconFlow" 2. "Opciones de traducción" - **"URL base para la API de SiliconFlow"**: Mantén el valor predeterminado 3. "Opciones de traducción" - **"Modelo de SiliconFlow a utilizar"**: Ingresa "Pro/deepseek-ai/DeepSeek-V3" u otros modelos 4. "Opciones de traducción" - **"Clave API para el servicio de SiliconFlow"**: Pega tu clave API 5. Haz clic en el botón "Traducir" al final de la página para iniciar la traducción 6. Una vez completada la traducción, podrás encontrar el archivo PDF traducido en la sección "Traducido" al final de la página.

# chunk_F44132D0
source: ## Acknowledgement
es: ## Agradecimientos

# chunk_ED8820C9
source: Thanks to [SiliconFlow](https://siliconflow.cn) for providing free translation service for this project.
es: Gracias a [SiliconFlow](https://siliconflow.cn) por proporcionar el servicio de traducción gratuito para este proyecto.

# chunk_DDD39913
source: [**Advanced**](./introduction.md) > **Advanced** _(current)_
es: [**Opciones avanzadas**](./introduction.md) > **Opciones avanzadas** _(actual)_

# chunk_D9B293FF
source: <h3 id="toc">Table of Contents</h3>
es: <h3 id="toc">Tabla de Contenidos</h3>

# chunk_D18951F5
source: - [Command Line Args](#command-line-args) - [Partial translation](#partial-translation) - [Specify source and target languages](#specify-source-and-target-languages) - [Translate wih exceptions](#translate-wih-exceptions) - [Custom prompt](#custom-prompt) - [Custom configuration](#custom-configuration) - [Skip clean](#skip-clean) - [Translation cache](#translation-cache) - [Deployment as a public services](#deployment-as-a-public-services) - [Authentication and welcome page](#authentication-and-welcome-page) - [Glossary Support](#glossary-support)
es: - [Argumentos de la línea de comandos](#argumentos-de-la-línea-de-comandos) - [Traducción parcial](#traducción-parcial) - [Especificar idiomas de origen y destino](#especificar-idiomas-de-origen-y-destino) - [Traducir con excepciones](#traducir-con-excepciones) - [Indicaciones personalizadas](#indicaciones-personalizadas) - [Configuración personalizada](#configuración-personalizada) - [Omitir limpieza](#omitir-limpieza) - [Caché de traducción](#caché-de-traducción) - [Despliegue como servicios públicos](#despliegue-como-servicios-públicos) - [Autenticación y página de bienvenida](#autenticación-y-página-de-bienvenida) - [Soporte de glosario](#soporte-de-glosario)

# chunk_3BF1A9B5
source: #### Command Line Args
es: #### Argumentos de la línea de comandos

# chunk_A2860DDF
source: Execute the translation command in the command line to generate the translated document `example-mono.pdf` and the bilingual document `example-dual.pdf` in the current working directory. Use Google as the default translation service. More support translation services can find [HERE](https://github.com/PDFMathTranslate/PDFMathTranslate-next/blob/main/docs/ADVANCED.md#services).
es: Ejecuta el comando de traducción en la línea de comandos para generar el documento traducido `example-mono.pdf` y el documento bilingüe `example-dual.pdf` en el directorio de trabajo actual. Utiliza Google como el servicio de traducción predeterminado. Puedes encontrar más servicios de traducción soportados [AQUÍ](https://github.com/PDFMathTranslate/PDFMathTranslate-next/blob/main/docs/ADVANCED.md#services).

# chunk_B3EB591F
source: In the following table, we list all advanced options for reference:
es: En la siguiente tabla, enumeramos todas las opciones avanzadas como referencia:

# chunk_A2A42E6B
source: ##### Args
es: ##### Argumentos

# chunk_7A00EE21
source: | Option | Function | Example | | ------------------------------- | -------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | | `files` | Local PDF file path | `pdf2zh ~/local.pdf` |
es: | Opción | Función | Ejemplo | | ------------------------------- | -------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | | `files` | Ruta del archivo PDF local | `pdf2zh ~/local.pdf` |

# chunk_848B1EE1
source: | `links` | Online files | `pdf2zh http://arxiv.org/paper.pdf` |
es: | `enlaces` | Archivos en línea | `pdf2zh http://arxiv.org/paper.pdf` |

# chunk_8B4991D7
source: | `--output` | Output directory for files | `pdf2zh example.pdf --output /outputpath` |
es: | `--output` | Directorio de salida para los archivos | `pdf2zh example.pdf --output /outputpath` |

# chunk_D7ED91EE
source: | `--<Services>` | Use [**specific service**](./Documentation-of-Translation-Services.md) for translation | `pdf2zh example.pdf --openai`<br>`pdf2zh example.pdf --deepseek` |
es: | `--<Services>` | Usar [**servicio específico**](./Documentation-of-Translation-Services.md) para la traducción | `pdf2zh example.pdf --openai`<br>`pdf2zh example.pdf --deepseek` |

# chunk_00AF4E48
source: | `--help`, `-h` | Show help message and exit | `pdf2zh -h` |
es: | `--help`, `-h` | Mostrar mensaje de ayuda y salir | `pdf2zh -h` |

# chunk_B0ABBFCE
source: | `--config-file` | Path to the configuration file | `pdf2zh --config-file /path/to/config/config.toml` |
es: | `--config-file` | Ruta al archivo de configuración | `pdf2zh --config-file /ruta/al/config/config.toml` |

# chunk_634BA748
source: | `--report-interval` | Progress report interval in seconds | `pdf2zh example.pdf --report-interval 5` |
es: | `--report-interval` | Intervalo de informe de progreso en segundos | `pdf2zh example.pdf --report-interval 5` |

# chunk_46037BF6
source: | `--debug` | Use debug logging level | `pdf2zh example.pdf --debug` |
es: | `--debug` | Usar nivel de registro de depuración | `pdf2zh example.pdf --debug` |

# chunk_18BA0512
source: | `--gui` | Interact with GUI | `pdf2zh --gui` |
es: | `--gui` | Interactuar con la interfaz gráfica de usuario (GUI) | `pdf2zh --gui` |

# chunk_0DA1F9CB
source: | `--warmup` | Only download and verify required assets then exit | `pdf2zh example.pdf --warmup` |
es: | `--warmup` | Solo descargar y verificar los recursos necesarios y luego salir | `pdf2zh example.pdf --warmup` |

# chunk_D380BDDD
source: | `--generate-offline-assets` | Generate offline assets package in the specified directory | `pdf2zh example.pdf --generate-offline-assets /path` |
es: | `--generate-offline-assets` | Generar paquete de recursos sin conexión en el directorio especificado | `pdf2zh example.pdf --generate-offline-assets /path` |

# chunk_F5703109
source: | `--restore-offline-assets` | Restore offline assets package from the specified directory | `pdf2zh example.pdf --restore-offline-assets /path` |
es: | `--restore-offline-assets` | Restaurar el paquete de recursos sin conexión desde el directorio especificado | `pdf2zh example.pdf --restore-offline-assets /ruta` |

# chunk_EB44345E
source: | `--version` | Show version then exit | `pdf2zh --version` |
es: | `--version` | Mostrar versión y salir | `pdf2zh --version` |

# chunk_AD6D96FE
source: | `--pages` | Partial document translation | `pdf2zh example.pdf --pages 1,2,1-,-3,3-5` |
es: | `--pages` | Traducción parcial del documento | `pdf2zh example.pdf --pages 1,2,1-,-3,3-5` |

# chunk_DB35B267
source: | `--lang-in` | The code of source language | `pdf2zh example.pdf --lang-in en` |
es: | `--lang-in` | El código del idioma de origen | `pdf2zh example.pdf --lang-in en` |

# chunk_CAF754AF
source: | `--lang-out` | The code of target language | `pdf2zh example.pdf --lang-out zh-CN` |
es: | `--lang-out` | El código del idioma de destino | `pdf2zh example.pdf --lang-out zh-CN` |

# chunk_2E1280AA
source: | `--min-text-length` | Minimum text length to translate | `pdf2zh example.pdf --min-text-length 5` |
es: | `--min-text-length` | Longitud mínima del texto a traducir | `pdf2zh example.pdf --min-text-length 5` |

# chunk_03902660
source: | `--rpc-doclayout` | RPC service host address for document layout analysis | |
es: | `--rpc-doclayout` | Dirección del host del servicio RPC para el análisis de diseño de documentos | |

# chunk_D3C262BD
source: | `--qps` | QPS limit for translation service | `pdf2zh example.pdf --qps 200` |
es: | `--qps` | Límite de QPS para el servicio de traducción | `pdf2zh example.pdf --qps 200` |

# chunk_0F22CD53
source: | `--ignore-cache` | Ignore translation cache | `pdf2zh example.pdf --ignore-cache` |
es: | `--ignore-cache` | Ignorar caché de traducción | `pdf2zh example.pdf --ignore-cache` |

# chunk_ED6020AC
source: | `--custom-system-prompt` | Custom system prompt for translation. Used for `/no_think` in Qwen 3 | `pdf2zh example.pdf --custom-system-prompt "/no_think You are a professional, authentic machine translation engine"` |
es: | `--custom-system-prompt` | Indicación personalizada del sistema para traducción. Utilizada para `/no_think` en Qwen 3 | `pdf2zh example.pdf --custom-system-prompt "/no_think You are a professional, authentic machine translation engine"` |

# chunk_FC174A78
source: | `--pool-max-worker` | Maximum number of workers for translation pool. If not set, will use qps as the number of workers | `pdf2zh example.pdf --pool-max-worker 100` |
es: | `--pool-max-worker` | Número máximo de trabajadores para el grupo de traducción. Si no se establece, se utilizará qps como el número de trabajadores | `pdf2zh example.pdf --pool-max-worker 100` |

# chunk_ED9DDA51
source: | `--no-auto-extract-glossary` | Disable auto extract glossary | `pdf2zh example.pdf --no-auto-extract-glossary` |
es: | `--no-auto-extract-glossary` | Desactivar la extracción automática del glosario | `pdf2zh example.pdf --no-auto-extract-glossary` |

# chunk_3A42A3F8
source: | `--primary-font-family` | Override primary font family for translated text. Choices: 'serif' for serif fonts, 'sans-serif' for sans-serif fonts, 'script' for script/italic fonts. If not specified, uses automatic font selection based on original text properties. | `pdf2zh example.pdf --primary-font-family serif` |
es: | `--primary-font-family` | Anula la familia de fuentes principal para el texto traducido. Opciones: 'serif' para fuentes serif, 'sans-serif' para fuentes sans-serif, 'script' para fuentes script/cursivas. Si no se especifica, utiliza la selección automática de fuentes basada en las propiedades del texto original. | `pdf2zh example.pdf --primary-font-family serif` |

# chunk_D91FDBD2
source: | `--no-dual` | Do not output bilingual PDF files | `pdf2zh example.pdf --no-dual` |
es: | `--no-dual` | No generar archivos PDF bilingües | `pdf2zh example.pdf --no-dual` |

# chunk_BF3C03E7
source: | `--no-mono` | Do not output monolingual PDF files | `pdf2zh example.pdf --no-mono` |
es: | `--no-mono` | No generar archivos PDF monolingües | `pdf2zh example.pdf --no-mono` |

# chunk_D70705B4
source: | `--formular-font-pattern` | Font pattern to identify formula text | `pdf2zh example.pdf --formular-font-pattern "(MS.*)"` |
es: | `--formular-font-pattern` | Patrón de fuente para identificar texto de fórmulas | `pdf2zh example.pdf --formular-font-pattern "(MS.*)"` |

# chunk_BC7944E0
source: | `--formular-char-pattern` | Character pattern to identify formula text | `pdf2zh example.pdf --formular-char-pattern "(MS.*)"` |
es: | `--formular-char-pattern` | Patrón de caracteres para identificar texto de fórmulas | `pdf2zh example.pdf --formular-char-pattern "(MS.*)"` |

# chunk_73F7BC27
source: | `--split-short-line` | Force split short line into different paragraphs | `pdf2zh example.pdf --split-short-line` |
es: | `--split-short-line` | Forzar la división de líneas cortas en diferentes párrafos | `pdf2zh example.pdf --split-short-line` |

# chunk_17ED68F1
source: | `--short-line-split-factor` | Split threshold factor for short lines | |
es: | `--short-line-split-factor` | Factor de umbral de división para líneas cortas | |

# chunk_B4E886EC
source: | `--skip-clean` | Skip PDF cleaning step | `pdf2zh example.pdf --skip-clean` |
es: | `--skip-clean` | Omitir el paso de limpieza del PDF | `pdf2zh example.pdf --skip-clean` |

# chunk_857F16B2
source: | `--dual-translate-first` | 在双 PDF 模式下优先放置翻译页 | `pdf2zh example.pdf --dual-translate-first` |
es: | `--dual-translate-first` | En el modo de PDF dual, priorizar la colocación de páginas traducidas | `pdf2zh example.pdf --dual-translate-first` |

# chunk_A04861D5
source: | `--disable-rich-text-translate` | Disable rich text translation | `pdf2zh example.pdf --disable-rich-text-translate` |
es: | `--disable-rich-text-translate` | Deshabilitar la traducción de texto enriquecido | `pdf2zh example.pdf --disable-rich-text-translate` |

# chunk_9D02F06D
source: | `--enhance-compatibility` | Enable all compatibility enhancement options | `pdf2zh example.pdf --enhance-compatibility` |
es: | `--enhance-compatibility` | Activar todas las opciones de mejora de compatibilidad | `pdf2zh example.pdf --enhance-compatibility` |

# chunk_7EC1028A
source: | `--use-alternating-pages-dual` | Use alternating pages mode for dual PDF | `pdf2zh example.pdf --use-alternating-pages-dual` |
es: | `--use-alternating-pages-dual` | Usar el modo de páginas alternas para PDF dual | `pdf2zh example.pdf --use-alternating-pages-dual` |

# chunk_D6BE0E79
source: | `--watermark-output-mode` | Watermark output mode for PDF files | `pdf2zh example.pdf --watermark-output-mode "NoWaterMark"` |
es: | `--watermark-output-mode` | Modo de marca de agua para archivos PDF | `pdf2zh example.pdf --watermark-output-mode "NoWaterMark"` |

# chunk_D63C027F
source: | `--max-pages-per-part` | Maximum pages per part for split translation | `pdf2zh example.pdf --max-pages-per-part 1` |
es: | `--max-pages-per-part` | Máximo de páginas por parte para traducción dividida | `pdf2zh example.pdf --max-pages-per-part 1` |

# chunk_3F10F28E
source: | `--translate-table-text` | Translate table text (experimental) | `pdf2zh example.pdf --translate-table-text` |
es: | `--translate-table-text` | Traducir texto de tablas (experimental) | `pdf2zh example.pdf --translate-table-text` |

# chunk_8BCCD462
source: | `--skip-scanned-detection` | Skip scanned detection | `pdf2zh example.pdf --skip-scanned-detection` |
es: | `--skip-scanned-detection` | Omitir detección de escaneado | `pdf2zh example.pdf --skip-scanned-detection` |

# chunk_75518F89
source: | `--ocr-workaround` | Force translated text to be black and add white background | `pdf2zh example.pdf --ocr-workaround` |
es: | `--ocr-workaround` | Forzar que el texto traducido sea negro y añadir un fondo blanco | `pdf2zh example.pdf --ocr-workaround` |

# chunk_E4BD664E
source: | `--auto-enable-ocr-workaround` | Enable automatic OCR workaround. If a document is detected as heavily scanned, this will attempt to enable OCR processing and skip further scan detection. See documentation for details. (default: False) | `pdf2zh example.pdf --auto-enable-ocr-workaround True` |
es: | `--auto-enable-ocr-workaround` | Habilitar solución alternativa automática de OCR. Si se detecta que un documento está muy escaneado, intentará habilitar el procesamiento de OCR y omitir la detección adicional de escaneo. Consulte la documentación para más detalles. (valor predeterminado: False) | `pdf2zh example.pdf --auto-enable-ocr-workaround True` |

# chunk_6803D13A
source: | `--only-include-translated-page`| Only include translated pages in the output PDF. Effective only when --pages is used. | `pdf2zh example.pdf --pages 1-5 --only-include-translated-page` |
es: | `--only-include-translated-page`| Solo incluir las páginas traducidas en el PDF de salida. Solo es efectivo cuando se usa --pages. | `pdf2zh example.pdf --pages 1-5 --only-include-translated-page` |

# chunk_1E404081
source: | `--glossaries` | Custom glossary for translation. | `pdf2zh example.pdf --glossaries "glossary1.csv,glossary2.csv,glossary3.csv"` |
es: | `--glossaries` | Glosario personalizado para traducción. | `pdf2zh example.pdf --glossaries "glossary1.csv,glossary2.csv,glossary3.csv"` |

# chunk_85EA2B26
source: | `--save-auto-extracted-glossary`| save automatically extracted glossary. | `pdf2zh example.pdf --save-auto-extracted-glossary` |
es: | `--save-auto-extracted-glossary`| guardar el glosario extraído automáticamente. | `pdf2zh example.pdf --save-auto-extracted-glossary` |

# chunk_140EFE95
source: ##### GUI Args
es: ##### Argumentos de GUI

# chunk_2D086D22
source: | Option | Function | Example | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--share` | Enable sharing mode | `pdf2zh --gui --share` |
es: | Opción | Función | Ejemplo | | ------------------------------- | -------------------------------------- | ----------------------------------------------- | | `--share` | Habilitar modo de compartir | `pdf2zh --gui --share` |

# chunk_927CDC03
source: | `--auth-file` | Path to the authentication file | `pdf2zh --gui --auth-file /path` |
es: | `--auth-file` | Ruta al archivo de autenticación | `pdf2zh --gui --auth-file /ruta` |

# chunk_951E61B3
source: | `--welcome-page` | Path to the welcome html file | `pdf2zh --gui --welcome-page /path` |
es: | `--welcome-page` | Ruta al archivo HTML de bienvenida | `pdf2zh --gui --welcome-page /ruta` |

# chunk_A9F2F2FE
source: | `--enabled-services` | Enabled translation services | `pdf2zh --gui --enabled-services "Bing,OpenAI"` |
es: | `--enabled-services` | Servicios de traducción habilitados | `pdf2zh --gui --enabled-services "Bing,OpenAI"` |

# chunk_2C863550
source: | `--disable-gui-sensitive-input` | Disable GUI sensitive input | `pdf2zh --gui --disable-gui-sensitive-input` |
es: | `--disable-gui-sensitive-input` | Deshabilitar entrada sensible en la GUI | `pdf2zh --gui --disable-gui-sensitive-input` |

# chunk_0598D53D
source: | `--disable-config-auto-save` | Disable automatic configuration saving | `pdf2zh --gui --disable-config-auto-save` |
es: | `--disable-config-auto-save` | Deshabilitar el guardado automático de configuración | `pdf2zh --gui --disable-config-auto-save` |

# chunk_99D3B3A8
source: | `--server-port` | WebUI Port | `pdf2zh --gui --server-port 7860` |
es: | `--server-port` | Puerto de WebUI | `pdf2zh --gui --server-port 7860` |

# chunk_ADC018D0
source: #### Partial translation
es: #### Traducción parcial

# chunk_A7D2451C
source: Use the `--pages` parameter to translate a portion of a document.
es: Utiliza el parámetro `--pages` para traducir una parte de un documento.

# chunk_C04AFE09
source: - If the page numbers are consecutive, you can write it like this:
es: - Si los números de página son consecutivos, puedes escribirlo así:

# chunk_773EEC89
source: > [!TIP] > `25-` includes all pages after page 25. If your document has 100 pages, this is equivalent to `25-100`. > > Similarly, `-25` includes all pages before page 25, which is equivalent to `1-25`.
es: > [!TIP] > `25-` incluye todas las páginas después de la página 25. Si tu documento tiene 100 páginas, esto es equivalente a `25-100`. > > Del mismo modo, `-25` incluye todas las páginas antes de la página 25, lo que equivale a `1-25`.

# chunk_1A89F075
source: - If the pages are not consecutive, you can use a comma `,` to separate them.
es: - Si las páginas no son consecutivas, puedes usar una coma `,` para separarlas.

# chunk_046E7E79
source: For example, if you want to translate the first and third pages, you can use the following command:
es: Por ejemplo, si deseas traducir la primera y tercera página, puedes usar el siguiente comando:
