Repository: zhenchuanpk2010/PDFMathTranslator
Catalog: docs/Contribute/*.po
Languages: es

# chunk_376C9855
source: - If the pages include both consecutive and non-consecutive ranges, you can also connect them with a comma, like this:
es: - Si las páginas incluyen rangos tanto consecutivos como no consecutivos, también puedes conectarlos con una coma, así:

# chunk_16D6BA70
source: This command will translate the first page, the third page, pages 10-20, and all pages from 25 to the end. [⬆️ Back to top](#toc)
es: Este comando traducirá la primera página, la tercera página, las páginas 10-20 y todas las páginas desde la 25 hasta el final. [⬆️ Volver arriba](#toc)

# chunk_482C5F18
source: #### Specify source and target languages
es: #### Especificar idiomas de origen y destino

# chunk_3E16227B
source: See [Google Languages Codes](https://developers.google.com/admin-sdk/directory/v1/languages), [DeepL Languages Codes](https://developers.deepl.com/docs/resources/supported-languages)
es: Consulta los [Códigos de idioma de Google](https://developers.google.com/admin-sdk/directory/v1/languages) y los [Códigos de idioma de DeepL](https://developers.deepl.com/docs/resources/supported-languages)

# chunk_EA41DE52
source: #### Translate wih exceptions
es: #### Traducir con excepciones

# chunk_6BAF2E56
source: Use regex to specify formula fonts and characters that need to be preserved:
es: Usar expresiones regulares para especificar fuentes de fórmulas y caracteres que deben preservarse:

# chunk_8FEF09F4
source: Preserve `Latex`, `Mono`, `Code`, `Italic`, `Symbol` and `Math` fonts by default:
es: Preservar las fuentes `Latex`, `Mono`, `Code`, `Italic`, `Symbol` y `Math` por defecto:

# chunk_37A13558
source: #### Custom prompt
es: #### Indicaciones personalizadas

# chunk_5F141742
source: Custom system prompt for translation. It is mainly used to add the '/no_think' instruction of Qwen 3 in the prompt.
es: Indicaciones personalizadas del sistema para traducción. Se utiliza principalmente para agregar la instrucción '/no_think' de Qwen 3 en la indicación.

# chunk_1EC5A9B5
source: #### Custom configuration
es: #### Configuración personalizada

# chunk_754794E1
source: There are multiple ways to modify and import the configuration file.
es: Existen múltiples formas de modificar e importar el archivo de configuración.

# chunk_B9BF8271
source: > [!NOTE] > **Configuration File Hierarchy** > > When modifying the same parameter using different methods, the software will apply changes according to the priority order below. > > Higher-ranked modifications will override lower-ranked ones. > > **cli/gui > env > user config file > default config file**
es: > [!NOTE] > **Jerarquía de archivos de configuración** > > Al modificar el mismo parámetro utilizando diferentes métodos, el software aplicará los cambios según el siguiente orden de prioridad. > > Las modificaciones de mayor prioridad anularán las de menor prioridad. > > **cli/gui > env > archivo de configuración del usuario > archivo de configuración predeterminado**

# chunk_06B261DE
source: - Modifying Configuration via **Command Line Arguments**
es: - Modificación de la configuración mediante **Argumentos de la línea de comandos**

# chunk_4579F74D
source: For most cases, you can directly pass your desired settings through command line arguments. Please refer to [Command Line Args](#cmd) for more information. For example, if you want to enable a GUI window, you can use the following command:
es: En la mayoría de los casos, puedes pasar directamente tus configuraciones deseadas a través de argumentos de la línea de comandos. Consulta [Argumentos de la línea de comandos](#cmd) para obtener más información. Por ejemplo, si deseas habilitar una ventana GUI, puedes usar el siguiente comando:

# chunk_85CC4581
source: - Modifying Configuration via **Environment Variables**
es: - Modificación de la configuración mediante **variables de entorno**

# chunk_A3573A4C
source: You can replace the `--` in command line arguments with `PDF2ZH_`, connect parameters using `=`, and replace `-` with `_` as environment variables. For example, if you want to enable a GUI window, you can use the following command:
es: Puedes reemplazar el `--` en los argumentos de la línea de comandos con `PDF2ZH_`, conectar parámetros usando `=`, y reemplazar `-` con `_` como variables de entorno. Por ejemplo, si deseas habilitar una ventana GUI, puedes usar el siguiente comando:

# chunk_11A0D60E
source: - User-Specified **Configuration File**
es: - Archivo de **configuración** especificado por el usuario

# chunk_9EE9DFB5
source: You can specify a configuration file using the command line argument below:
es: Puedes especificar un archivo de configuración utilizando el siguiente argumento de la línea de comandos:

# chunk_FC4FBE9E
source: If you are unsure about the config file format, please refer to the default configuration file described below.
es: Si no está seguro del formato del archivo de configuración, consulte el archivo de configuración predeterminado que se describe a continuación.

# chunk_A4C0C077
source: - **Default Configuration File**
es: - **Archivo de Configuración Predeterminado**

# chunk_B17D9FE3
source: The default configuration file is located at `~/.config/pdf2zh`. Please do not modify the configuration files in the `default` directory. It is strongly recommended to refer to this configuration file's content and use **User-Specified Configuration File** to implement your own configuration file.
es: El archivo de configuración predeterminado se encuentra en `~/.config/pdf2zh`. Por favor, no modifiques los archivos de configuración en el directorio `default`. Se recomienda encarecidamente consultar el contenido de este archivo de configuración y utilizar **Configuración personalizada** para implementar tu propio archivo de configuración.

# chunk_15DFB8EE
source: > [!TIP] > - By default, pdf2zh 2.0 automatically saves the current configuration to `~/.config/pdf2zh/config.v3.toml` each time you click the translate button in the GUI. This configuration file will be loaded by default on the next startup. > - The configuration files in the `default` directory are automatically generated by the program. You can copy them for modification, but please do not modify them directly. > - Configuration files may include version numbers such as "v2", "v3", etc. These are **configuration file version numbers**, **not** the version number of pdf2zh itself.
es: > [!TIP] > - Por defecto, pdf2zh 2.0 guarda automáticamente la configuración actual en `~/.config/pdf2zh/config.v3.toml` cada vez que haces clic en el botón de traducción en la GUI. Este archivo de configuración se cargará por defecto en el próximo inicio. > - Los archivos de configuración en el directorio `default` son generados automáticamente por el programa. Puedes copiarlos para modificarlos, pero por favor no los modifiques directamente. > - Los archivos de configuración pueden incluir números de versión como "v2", "v3", etc. Estos son **números de versión del archivo de configuración**, **no** el número de versión de pdf2zh en sí.

# chunk_870EBD0C
source: #### Skip clean
es: #### Omitir limpieza

# chunk_012D63A3
source: When this parameter is set to True, the PDF cleaning step will be skipped, which can improve compatibility and avoid some font processing issues. Usage:
es: Cuando este parámetro se establece en True, se omitirá el paso de limpieza del PDF, lo que puede mejorar la compatibilidad y evitar algunos problemas de procesamiento de fuentes. Uso:

# chunk_1078AA87
source: Or using environment variables:
es: O utilizando variables de entorno:

# chunk_E510ADDB
source: > [!TIP] > When `--enhance-compatibility` is enabled, Skip clean is automatically enabled.
es: > [!TIP] > Cuando `--enhance-compatibility` está habilitado, Omitir limpieza se activa automáticamente.

# chunk_A35603CF
source: #### Translation cache
es: #### Caché de traducción

# chunk_F8D49E02
source: PDFMathTranslate caches translated texts to increase speed and avoid unnecessary API calls for same contents. You can use `--ignore-cache` option to ignore translation cache and force retranslation.
es: PDFMathTranslate almacena en caché los textos traducidos para aumentar la velocidad y evitar llamadas API innecesarias para los mismos contenidos. Puedes usar la opción `--ignore-cache` para ignorar la caché de traducción y forzar la retraducción.

# chunk_05080CDF
source: #### Deployment as a public services
es: #### Despliegue como servicios públicos

# chunk_A72BDF82
source: When deploying a pdf2zh GUI on public services, you should modify the configuration file as described below.
es: Al desplegar una GUI de pdf2zh en servicios públicos, debes modificar el archivo de configuración como se describe a continuación.

# chunk_9F68F89E
source: > [!TIP] > - When deploying publicly, both `disable_gui_sensitive_input` and `disable_config_auto_save` should be enabled. > - Separate different available services with *English commas* <kbd>,</kbd> .
es: > [!TIP] > - Al desplegar públicamente, tanto `disable_gui_sensitive_input` como `disable_config_auto_save` deben estar habilitados. > - Separe los diferentes servicios disponibles con *comas en inglés* <kbd>,</kbd> .

# chunk_F2D0AEC1
source: A usable configuration is as follows:
es: Una configuración utilizable es la siguiente:

# chunk_E255AB78
source: #### Authentication and welcome page
es: #### Autenticación y página de bienvenida

# chunk_1A5EEA9C
source: When using Authentication and welcome page to specify which user to use Web UI and custom the login page: example auth.txt Each line contains two elements, username, and password, separated by a comma.
es: Al usar Autenticación y página de bienvenida para especificar qué usuario debe usar Web UI y personalizar la página de inicio de sesión: ejemplo auth.txt Cada línea contiene dos elementos, nombre de usuario y contraseña, separados por una coma.

# chunk_0CEA118C
source: example welcome.html
es: ejemplo welcome.html

# chunk_40E12FA3
source: > [!NOTE] > welcome page will work if only authentication file is not blank. > If authentication file is blank, there will be no authentication. :)
es: > [!NOTE] > La página de bienvenida funcionará solo si el archivo de autenticación no está en blanco. > Si el archivo de autenticación está en blanco, no habrá autenticación. :)

# chunk_4A9C44BF
source: #### Glossary Support
es: #### Soporte de glosario

# chunk_65580DD5
source: PDFMathTranslate supports the glossary table. The glossary tables file should be `csv` file. There are three columns in file. Here is a demo glossary file:
es: PDFMathTranslate soporta la tabla de glosario. El archivo de tablas de glosario debe ser un archivo `csv`. Hay tres columnas en el archivo. Aquí hay un archivo de glosario de demostración:

# chunk_2403CA4A
source: | source | target | tgt_lng | |--------|---------|---------| | AutoML | 自动 ML | zh-CN | | a,a | a | zh-CN | | " | " | zh-CN |
es: | fuente | objetivo | idioma_destino | |--------|---------|---------| | AutoML | ML automático | es | | a,a | a | es | | " | " | es |

# chunk_598725B0
source: For CLI user: You can use multiple files for glossary. And different files should be split by `,`.
es: Para usuarios de CLI: Puedes usar múltiples archivos para el glosario. Y los diferentes archivos deben estar separados por `,`.

# chunk_B3174CBC
source: For WebUI user: You can upload your own glossary file now. After you uploaded the file, you can check them by click their name and the content shows below. [⬆️ Back to top](#toc)
es: Para usuarios de WebUI: Ahora puedes subir tu propio archivo de glosario. Después de subir el archivo, puedes verificarlo haciendo clic en su nombre y el contenido se mostrará a continuación. [⬆️ Volver al inicio](#toc)

# chunk_0D45C98F
source: ### Advanced
es: ### Opciones avanzadas

# chunk_F16EF37C
source: This section is intended for advanced users of this software. Here you can find:
es: Esta sección está destinada a usuarios avanzados de este software. Aquí puedes encontrar:

# chunk_5FC80BEA
source: 1. [**Advanced Usage**](./advanced.md)
es: 1. [**Opciones avanzadas**](./advanced.md)

# chunk_7B3D7A76
source: <br> In this section, you can explore specify source/target languages, switch translation services, and more.
es: <br> En esta sección, puedes explorar idiomas de origen/destino específicos, cambiar servicios de traducción y más.

# chunk_7A0A4B36
source: 2. [**Language Code**](./Language-Codes.md)
es: 2. [**Código de idioma**](./Language-Codes.md)

# chunk_298EB9AE
source: <br> If you are unsure about which codes to use for translating your source/target languages, you can find them here.
es: <br> Si no estás seguro de qué códigos usar para traducir tus idiomas de origen/destino, puedes encontrarlos aquí.

# chunk_A956AA16
source: 3. [**Documentation of Translation Services**](./Documentation-of-Translation-Services.md)
es: 3. [**Documentación de servicios de traducción**](./Documentation-of-Translation-Services.md)

# chunk_49F0D79D
source: <br> If you need to review the documentation provided by the translation services you are using, please refer to this page.
es: <br> Si necesitas revisar la documentación proporcionada por los servicios de traducción que estás utilizando, consulta esta página.

# chunk_53390D48
source: # Contributing to the Project
es: # Contribuir al proyecto

# chunk_A71D833E
source: > [!CAUTION] > > The current project maintainers are researching automated documentation internationalization. Therefore, any PRs related to documentation internationalization/translation will NOT be accepted! > > Please do NOT submit PRs related to documentation internationalization/translation!
es: > [!CAUTION] > > Los mantenedores actuales del proyecto están investigando la internacionalización automatizada de la documentación. Por lo tanto, ¡NO se aceptarán PRs relacionados con la internacionalización/traducción de la documentación! > > ¡Por favor, NO envíes PRs relacionados con la internacionalización/traducción de la documentación!

# chunk_D57757D9
source: Thank you for your interest in this project! Before you start contributing, please take some time to read the following guidelines to ensure your contribution can be smoothly accepted.
es: Gracias por tu interés en este proyecto. Antes de empezar a contribuir, por favor tómate un tiempo para leer las siguientes pautas para asegurar que tu contribución pueda ser aceptada sin problemas.

# chunk_FB836CBD
source: ## Types of Contributions Not Accepted
es: ## Tipos de contribuciones no aceptadas

# chunk_F2331818
source: 1. Documentation internationalization/translation 2. Contributions related to core infrastructure, such as HTTP API, etc. 3. Issues explicitly marked as "No help needed" (including issues in the [Byaidu/PDFMathTranslate](Byaidu/PDFMathTranslate) and the [PDFMathTranslate/PDFMathTranslate-next](PDFMathTranslate/PDFMathTranslate-next) repository). 4. Other contributions deemed inappropriate by the maintainers. 5. Contributing documentation, but changing the documentation in languages other than English. 6. PRs that require modifying PDF files.
es: 1. Documentación de internacionalización/traducción 2. Contribuciones relacionadas con la infraestructura central, como API HTTP, etc. 3. Problemas marcados explícitamente como "No se necesita ayuda" (incluyendo problemas en los repositorios [Byaidu/PDFMathTranslate](Byaidu/PDFMathTranslate) y [PDFMathTranslate/PDFMathTranslate-next](PDFMathTranslate/PDFMathTranslate-next)). 4. Otras contribuciones consideradas inapropiadas por los mantenedores. 5. Contribuir a la documentación, pero modificando la documentación en idiomas distintos al inglés. 6. PRs que requieran modificar archivos PDF.

# chunk_7828B7C7
source: Please do NOT submit PRs related to the above types.
es: Por favor, NO envíes PRs relacionados con los tipos mencionados anteriormente.

# chunk_56FADEC9
source: > [!NOTE] > > If you want to contribute documentation, please **only modify the English version of the documentation**. Other language versions are translated by contributors themselves.
es: > [!NOTE] > > Si deseas contribuir con la documentación, por favor **solo modifiques la versión en inglés de la documentación**. Las versiones en otros idiomas son traducidas por los propios colaboradores.

# chunk_485712CB
source: ## Contribution Process
es: ## Proceso de contribución

# chunk_4D698FBF
source: 1. Fork this repository and clone it locally. 2. Create a new branch: `git checkout -b feature/<feature-name>`. 3. Develop and ensure your code meets the requirements. 4. Commit your code: ```bash git add . git commit -m "<semantic commit message>" ``` 5. Push to your repository: `git push origin feature/<feature-name>`. 6. Create a PR on GitHub, provide a detailed description, and request a review from [@awwaawwa](https://github.com/awwaawwa). 7. Ensure all automated checks pass.
es: 1. Haz un fork de este repositorio y clónalo localmente. 2. Crea una nueva rama: `git checkout -b feature/<feature-name>`. 3. Desarrolla y asegúrate de que tu código cumpla con los requisitos. 4. Confirma tus cambios: ```bash git add . git commit -m "<semantic commit message>" ``` 5. Sube los cambios a tu repositorio: `git push origin feature/<feature-name>`. 6. Crea un PR en GitHub, proporciona una descripción detallada y solicita una revisión a [@awwaawwa](https://github.com/awwaawwa). 7. Asegúrate de que todas las verificaciones automatizadas pasen.

# chunk_89A6F55A
source: > [!TIP] > > You do not need to wait until your development is fully complete to create a PR. Creating one early allows us to review your implementation and provide suggestions. > > If you have any questions about the source code or related matters, please contact the maintainer at aw@funstory.ai. > > Resource files for version 2.0 are shared with [BabelDOC](https://github.com/funstory-ai/BabelDOC). The code for downloading related resources is in BabelDOC. If you want to add new resource files, please contact the BabelDOC maintainer at aw@funstory.ai.
es: > [!TIP] > > No es necesario esperar hasta que tu desarrollo esté completamente terminado para crear un PR. Crear uno temprano nos permite revisar tu implementación y proporcionar sugerencias. > > Si tienes alguna pregunta sobre el código fuente o asuntos relacionados, por favor contacta al mantenedor en aw@funstory.ai. > > Los archivos de recursos para la versión 2.0 se comparten con [BabelDOC](https://github.com/funstory-ai/BabelDOC). El código para descargar los recursos relacionados está en BabelDOC. Si deseas agregar nuevos archivos de recursos, por favor contacta al mantenedor de BabelDOC en aw@funstory.ai.

# chunk_E7638696
source: ## Basic Requirements
es: ## Requisitos básicos

# chunk_4D251FB3
source: <h4 id="sop">1. Workflow</h4>
es: <h4 id="sop">1. Flujo de trabajo</h4>

# chunk_8FDDA473
source: - Please fork from the `main` branch and develop on your forked branch. - When submitting a Pull Request (PR), provide a detailed description of your changes. - If your PR does not pass automated checks (indicated by `checks failed` and a red cross), please review the corresponding `details` and modify your submission to ensure the new PR passes all checks.
es: - Por favor, haz un fork desde la rama `main` y desarrolla en tu rama bifurcada. - Al enviar una Pull Request (PR), proporciona una descripción detallada de tus cambios. - Si tu PR no pasa las verificaciones automatizadas (indicadas por `checks failed` y una cruz roja), revisa los `details` correspondientes y modifica tu envío para asegurar que la nueva PR pase todas las verificaciones.

# chunk_19D447DF
source: <h4 id="dev&test">2. Development and Testing</h4>
es: <h4 id="dev&test">2. Desarrollo y Pruebas</h4>

# chunk_65AB8932
source: - Use the command `pip install -e .` for development and testing.
es: - Usa el comando `pip install -e .` para desarrollo y pruebas.

# chunk_B4865580
source: <h4 id="format">3. Code Formatting</h4>
es: <h4 id="formato">3. Formato de código</h4>

# chunk_E8324FFA
source: - Configure the `pre-commit` tool and enable `black` and `flake8` for code formatting.
es: - Configura la herramienta `pre-commit` y habilita `black` y `flake8` para el formato del código.

# chunk_7A584B10
source: <h4 id="requpdate">4. Dependency Updates</h4>
es: <h4 id="requpdate">4. Actualizaciones de dependencias</h4>

# chunk_BE2E8298
source: - If you introduce new dependencies, please update the dependency list in the `pyproject.toml` file in a timely manner.
es: - Si introduces nuevas dependencias, actualiza la lista de dependencias en el archivo `pyproject.toml` de manera oportuna.

# chunk_1615D8D8
source: <h4 id="docupdate">5. Documentation Updates</h4>
es: <h4 id="docupdate">5. Actualizaciones de documentación</h4>

# chunk_725E4B8A
source: - If you add new command-line options, please update the list of command-line options in all language versions of the `README.md` file accordingly.
es: - Si agregas nuevas opciones de línea de comandos, por favor actualiza la lista de opciones de línea de comandos en todas las versiones de idioma del archivo `README.md` correspondientemente.

# chunk_09178615
source: <h4 id="commitmsg">6. Commit Messages</h4>
es: <h4 id="commitmsg">6. Mensajes de commit</h4>

# chunk_8007BC97
source: - Use [Conventional Commits](https://www.conventionalcommits.org/en/v1.0.0/), for example: `feat(translator): add openai`.
es: - Usa [Conventional Commits](https://www.conventionalcommits.org/en/v1.0.0/), por ejemplo: `feat(translator): add openai`.

# chunk_F5439516
source: <h4 id="codestyle">7. Coding Style</h4>
es: <h4 id="codestyle">7. Estilo de codificación</h4>

# chunk_22ECCE1D
source: - Ensure your submitted code adheres to basic coding style standards. - Use either snake_case or camelCase for variable naming.
es: - Asegúrate de que el código enviado cumpla con los estándares básicos de estilo de codificación. - Utiliza snake_case o camelCase para el nombrado de variables.

# chunk_2F60B8EB
source: <h4 id="doctypo">8. Documentation Formatting</h4>
es: <h4 id="doctypo">8. Formato de documentación</h4>

# chunk_320F91BE
source: - For `README.md` formatting, please follow the [Chinese Copywriting Guidelines](https://github.com/sparanoid/chinese-copywriting-guidelines). - Ensure that both English and Chinese documentation are always up to date; other language documentation updates are optional.
es: - Para el formato de `README.md`, sigue las [Directrices de redacción en chino](https://github.com/sparanoid/chinese-copywriting-guidelines). - Asegúrate de que tanto la documentación en inglés como en chino estén siempre actualizadas; las actualizaciones de la documentación en otros idiomas son opcionales.

# chunk_126AF33C
source: ## Adding a Translation Engine
es: ## Agregar un motor de traducción

# chunk_38A36DFF
source: 1. Add a new translator configuration class in the `pdf2zh/config/translate_engine_model.py` file. 2. Add an instance of the new translator configuration class to the `TRANSLATION_ENGINE_SETTING_TYPE` type alias in the same file. 3. Add the new translator implementation class in the `pdf2zh/translator/translator_impl` folder.
es: 1. Agrega una nueva clase de configuración de traductor en el archivo `pdf2zh/config/translate_engine_model.py`. 2. Agrega una instancia de la nueva clase de configuración de traductor al alias de tipo `TRANSLATION_ENGINE_SETTING_TYPE` en el mismo archivo. 3. Agrega la nueva clase de implementación de traductor en la carpeta `pdf2zh/translator/translator_impl`.
