Repository: zhenchuanpk2010/PDFMathTranslator
Catalog: docs/Contribute/*.po
Languages: es

# chunk_5B4684E1
source: > [!NOTE] > > This project does not intend to support any translation engines with an RPS (requests per second) lower than 4. Please do not submit support for such engines.
es: > [!NOTE] > > Este proyecto no tiene la intención de soportar ningún motor de traducción con un RPS (solicitudes por segundo) inferior a 4. Por favor, no envíes soporte para este tipo de motores.

# chunk_7ED6230D
source: ## Project Structure
es: ## Estructura del proyecto

# chunk_9004E6A3
source: - **config folder**: Configuration system. - **translator folder**: Translator-related implementations. - **gui.py**: Provides the GUI interface. - **const.py**: Some constants. - **main.py**: Provides the command-line tool. - **high_level.py**: High-level interfaces based on BabelDOC. - **http_api.py**: Provides HTTP API (not started).
es: - **config folder**: Sistema de configuración. - **translator folder**: Implementaciones relacionadas con el traductor. - **gui.py**: Proporciona la interfaz gráfica de usuario. - **const.py**: Algunas constantes. - **main.py**: Proporciona la herramienta de línea de comandos. - **high_level.py**: Interfaces de alto nivel basadas en BabelDOC. - **http_api.py**: Proporciona API HTTP (no iniciado).

# chunk_0C087ADF
source: ## Contact Us
es: ## Contáctanos

# chunk_2FB8F835
source: If you have any questions, please submit feedback via Issue or join our Telegram Group. Thank you for your contribution!
es: Si tienes alguna pregunta, por favor envía tus comentarios a través de Issue o únete a nuestro Grupo de Telegram. ¡Gracias por tu contribución!

# chunk_C2A414AC
source: > [!TIP] > > [Immersive Translate](https://immersivetranslate.com) sponsors monthly Pro membership codes for active contributors to this project. For details, please see: [BabelDOC/PDFMathTranslate Contributor Reward Rules](https://funstory-ai.github.io/BabelDOC/CONTRIBUTOR_REWARD/)
es: > [!TIP] > > [Immersive Translate](https://immersivetranslate.com) patrocina códigos de membresía Pro mensuales para los contribuyentes activos de este proyecto. Para más detalles, consulta: [Reglas de recompensa para contribuyentes de BabelDOC/PDFMathTranslate](https://funstory-ai.github.io/BabelDOC/CONTRIBUTOR_REWARD/)

# chunk_D0E62F41
source: # Suggesting Improvements to the Documentation Translations
es: # Sugerencias para mejorar las traducciones de la documentación

# chunk_5E99F395
source: Thank you for your interest in this project! The non‑English documentation is automatically translated by large language models, so mistakes are inevitable. If you notice issues in a language you are familiar with, we warmly welcome your suggestions for improvement. Before you start contributing, please take a moment to read the following guide to help ensure your suggestions can be smoothly accepted.
es: Gracias por tu interés en este proyecto. La documentación en idiomas distintos al inglés se traduce automáticamente mediante modelos de lenguaje avanzados, por lo que los errores son inevitables. Si detectas problemas en un idioma que conoces, te damos la más cordial bienvenida a enviar sugerencias de mejora. Antes de comenzar a contribuir, por favor tómate un momento para leer la siguiente guía, que te ayudará a asegurar que tus sugerencias puedan ser aceptadas sin problemas.

# chunk_B08C64DE
source: # Submit Suggestions via Weblate
es: # Enviar sugerencias a través de Weblate

# chunk_66E75B28
source: We use [Weblate](https://weblate.org/) to manage our documentation translations. You can check the current translation status and submit suggestions on the [project's Weblate page](https://hosted.weblate.org/projects/pdfmathtranslate-next/).
es: Utilizamos [Weblate](https://weblate.org/) para gestionar las traducciones de nuestra documentación. Puedes consultar el estado actual de las traducciones y enviar sugerencias en la [página de Weblate del proyecto](https://hosted.weblate.org/projects/pdfmathtranslate-next/).

# chunk_800CE400
source: ## How to submit a suggestion
es: ## Cómo enviar una sugerencia

# chunk_B3B32731
source: It's very simple to propose translation improvements via Weblate, and you don't even need to register an account. Read on for the step-by-step process. Assume you want to improve the first sentence in the "Command-line arguments" section of [Advanced → Advanced](docs/en/advanced/advanced.md):
es: Es muy sencillo proponer mejoras en las traducciones a través de Weblate, y ni siquiera necesitas registrar una cuenta. Sigue leyendo para conocer el proceso paso a paso. Supongamos que deseas mejorar la primera frase en la sección "命令行参数" de [高级选项 → 高级](docs/en/advanced/advanced.md):

# chunk_3B565B8D
source: 1. Open the [project's Weblate page](https://hosted.weblate.org/projects/pdfmathtranslate-next/). 2. Click `Search` at the top.
es: 1. Abre la [página de Weblate del proyecto](https://hosted.weblate.org/projects/pdfmathtranslate-next/). 2. Haz clic en `Search` en la parte superior.

# chunk_961D5AD9
source: 3. In "Filter", enter the text segment you want to find. Partial text is fine.
es: 3. En "Filtro", ingresa el segmento de texto que deseas encontrar. Texto parcial está bien.

# chunk_7F95E46F
source: When you're done, press <kbd>Enter</kbd>.
es: Cuando hayas terminado, presiona <kbd>Enter</kbd>.

# chunk_49D0E074
source: 4. After pressing <kbd>Enter</kbd>, you'll be taken to the search results page. Click the result you prefer to open the edit view.
es: 4. Después de presionar <kbd>Enter</kbd>, serás llevado a la página de resultados de búsqueda. Haz clic en el resultado que prefieras para abrir la vista de edición.

# chunk_89F91031
source: 5. In the edit view, make your changes to the translation. When finished, click <kbd>Suggest</kbd>. That's it—you've successfully completed a contribution.
es: 5. En la vista de edición, realiza los cambios en la traducción. Cuando termines, haz clic en <kbd>Sugerir</kbd>. Eso es todo—has completado con éxito una contribución.

# chunk_998E5059
source: We will review your suggestion after it's submitted. Once approved, your changes will appear in the documentation.
es: Revisaremos tu sugerencia después de que sea enviada. Una vez aprobada, tus cambios aparecerán en la documentación.

# chunk_F3B96F2D
source: [**Getting Started**](./getting-started.md) > **Installation** > **Docker** _(current)_
es: [**Empezar**](./getting-started.md) > **Instalación** > **Docker** _(actual)_

# chunk_3EBE8361
source: ### Install PDFMathTranslate via docker
es: ### Instalar PDFMathTranslate mediante docker

# chunk_760A6888
source: #### What is docker?
es: #### ¿Qué es docker?

# chunk_41775DAE
source: [Docker](https://docs.docker.com/get-started/docker-overview/) is an open platform for developing, shipping, and running applications. Docker enables you to separate your applications from your infrastructure so you can deliver software quickly. With Docker, you can manage your infrastructure in the same ways you manage your applications. By taking advantage of Docker's methodologies for shipping, testing, and deploying code, you can significantly reduce the delay between writing code and running it in production.
es: [Docker](https://docs.docker.com/get-started/docker-overview/) es una plataforma abierta para desarrollar, enviar y ejecutar aplicaciones. Docker te permite separar tus aplicaciones de tu infraestructura para que puedas entregar software rápidamente. Con Docker, puedes gestionar tu infraestructura de la misma manera que gestionas tus aplicaciones. Al aprovechar las metodologías de Docker para enviar, probar e implementar código, puedes reducir significativamente el retraso entre escribir código y ejecutarlo en producción.

# chunk_6EBC627B
source: #### Installation
es: #### Instalación

# chunk_BA8550C2
source: <h4>1. Pull and run:</h4>
es: <h4>1. Extraer y ejecutar:</h4>

# chunk_B1F3E7B5
source: > [!NOTE] > > - If you cannot access Docker Hub, please try the image on [GitHub Container Registry](https://github.com/PDFMathTranslate/PDFMathTranslate-next/pkgs/container/pdfmathtranslate). > > ```bash > docker pull ghcr.io/PDFMathTranslate/PDFMathTranslate-next > docker run -d -p 7860:7860 ghcr.io/PDFMathTranslate/PDFMathTranslate-next > ```
es: > [!NOTE] > > - Si no puedes acceder a Docker Hub, prueba con la imagen en [GitHub Container Registry](https://github.com/PDFMathTranslate/PDFMathTranslate-next/pkgs/container/pdfmathtranslate). > > ```bash > docker pull ghcr.io/PDFMathTranslate/PDFMathTranslate-next > docker run -d -p 7860:7860 ghcr.io/PDFMathTranslate/PDFMathTranslate-next > ```

# chunk_0222B95B
source: <h4>2. Enter this URL in your default browser to open the WebUI page:</h4>
es: <h4>2. Ingresa esta URL en tu navegador predeterminado para abrir la página WebUI:</h4>

# chunk_B5C49A1E
source: > [!NOTE] > If you encounter any issues during use WebUI, please refer to [Usage --> WebUI](./USAGE_webui.md). > [!NOTE] > If you encounter any issues during use command line, please refer to [Usage --> Command Line](./USAGE_commandline.md).
es: > [!NOTE] > Si encuentras algún problema al usar WebUI, consulta [Uso --> WebUI](./USAGE_webui.md). > [!NOTE] > Si encuentras algún problema al usar la línea de comandos, consulta [Uso --> Línea de comandos](./USAGE_commandline.md).

# chunk_23005398
source: [**Getting Started**](./getting-started.md) > **Installation** > **uv** _(current)_
es: [**Empezar**](./getting-started.md) > **Instalación** > **uv** _(actual)_

# chunk_D43EE31C
source: ### Install PDFMathTranslate via uv
es: ### Instalar PDFMathTranslate mediante uv

# chunk_1BF9C99B
source: #### What is uv? How to install it?
es: #### ¿Qué es uv? ¿Cómo instalarlo?

# chunk_8963BEA0
source: uv is an extremely fast Python package and project manager, written in Rust. <br> To install uv on your computer, please refer to [this article](https://docs.astral.sh/uv/getting-started/installation/).
es: uv es un gestor de paquetes y proyectos de Python extremadamente rápido, escrito en Rust. <br> Para instalar uv en tu computadora, consulta [este artículo](https://docs.astral.sh/uv/getting-started/installation/).

# chunk_05BD0E93
source: 1. Python installed (3.10 <= version <= 3.12); 2. Use the following command to use our package: ```bash pip install uv uv tool install --python 3.12 pdf2zh-next ```
es: 1. Python instalado (versión 3.10 <= versión <= 3.12); 2. Utilice el siguiente comando para usar nuestro paquete: ```bash pip install uv uv tool install --python 3.12 pdf2zh-next ```

# chunk_74F9EC5E
source: After installation, you can start translation via the **command line** or **WebUI**.
es: Después de la instalación, puedes comenzar la traducción mediante la **línea de comandos** o **WebUI**.

# chunk_747DC3A8
source: !!! Warning If you see the error `command not found: pdf2zh_next` when running, please configure the environment variables as follows and try again: === "macOS and Linux" Add the following to your ~/.zshrc: ```console export PATH="$PATH:/Users/Username/.local/bin" ``` Then restart your terminal === "Windows" Enter the following in PowerShell: ```powershell $env:Path = "C:\Users\Username\.local\bin;$env:Path" ``` Then restart your terminal
es: !!! Warning Si ves el error `command not found: pdf2zh_next` al ejecutar, por favor configura las variables de entorno de la siguiente manera e inténtalo de nuevo: === "macOS y Linux" Añade lo siguiente a tu ~/.zshrc: ```console export PATH="$PATH:/Users/Username/.local/bin" ``` Luego reinicia tu terminal === "Windows" Ingresa lo siguiente en PowerShell: ```powershell $env:Path = "C:\Users\Username\.local\bin;$env:Path" ``` Luego reinicia tu terminal

# chunk_C86DFF6A
source: > [!NOTE] > If you encounter any issues during use WebUI, please refer to [Usage --> WebUI](./USAGE_webui.md). > [!NOTE] > If you encounter any issues during use command line, please refer to [Usage --> Command Line](./USAGE_commandline.md).
es: > [!NOTE] > Si encuentras algún problema al usar WebUI, consulta [Uso --> WebUI](./USAGE_webui.md). > [!NOTE] > Si encuentras algún problema al usar la línea de comandos, consulta [Uso --> Línea de comandos](./USAGE_commandline.md).

# chunk_E5616440
source: [**Getting Started**](./getting-started.md) > **Installation** > **Windows EXE** _(current)_
es: [**Empezar**](./getting-started.md) > **Instalación** > **Windows EXE** _(actual)_

# chunk_F372470F
source: ### Install PDFMathTranslate via .exe file
es: ### Instalar PDFMathTranslate mediante archivo .exe

# chunk_D3A98932
source: ***Step 1*** | Download `pdf2zh-<version>-with-assets-win64.zip` from [release page](https://github.com/PDFMathTranslate/PDFMathTranslate-next/releases).
es: ***Paso 1*** | Descarga `pdf2zh-<version>-with-assets-win64.zip` desde la [página de lanzamientos](https://github.com/PDFMathTranslate/PDFMathTranslate-next/releases).

# chunk_29FE8C1D
source: > [!TIP] > **What is the difference between `pdf2zh-<version>-with-assets-win64.zip` and `pdf2zh-<version>-win64.zip`?** > > - If you are downloading and using PDFMathTranslate for the first time, it is recommended to download `pdf2zh-<version>-with-assets-win64.zip`. > - The `pdf2zh-<version>-with-assets-win64.zip` includes resource files (such as fonts and models) compared to `pdf2zh-<version>-win64.zip`. > - The version without assets will also dynamically download resources when running, but the download may fail due to network issues.
es: > [!TIP] > **¿Cuál es la diferencia entre `pdf2zh-<version>-with-assets-win64.zip` y `pdf2zh-<version>-win64.zip`?** > > - Si es la primera vez que descargas y usas PDFMathTranslate, se recomienda descargar `pdf2zh-<version>-with-assets-win64.zip`. > - El archivo `pdf2zh-<version>-with-assets-win64.zip` incluye archivos de recursos (como fuentes y modelos) en comparación con `pdf2zh-<version>-win64.zip`. > - La versión sin recursos también descargará dinámicamente los recursos al ejecutarse, pero la descarga puede fallar debido a problemas de red.

# chunk_17427D5A
source: ***Step 2*** | Unzip `pdf2zh-<version>-with-assets-win64.zip` and navigate `pdf2zh` folder. It takes a while to decompress, please be patient. ***Step 3*** | Navigate `pdf2zh` folder, then Double-click `pdf2zh.exe`.
es: ***Paso 2*** | Descomprime `pdf2zh-<version>-with-assets-win64.zip` y navega hasta la carpeta `pdf2zh`. La descompresión puede tomar un tiempo, por favor ten paciencia. ***Paso 3*** | Navega hasta la carpeta `pdf2zh`, luego haz doble clic en `pdf2zh.exe`.

# chunk_B4068DB4
source: > [!TIP] > **Cannot run the .exe file** > > If you have some problems running pdf2zh.exe, please install `https://aka.ms/vs/17/release/vc_redist.x64.exe` and try again.
es: > [!TIP] > **No se puede ejecutar el archivo .exe** > > Si tienes problemas al ejecutar pdf2zh.exe, por favor instala `https://aka.ms/vs/17/release/vc_redist.x64.exe` e inténtalo de nuevo.

# chunk_68C037E0
source: ***Step 4*** | A terminal will pop up after double-clicking the exe file. After about half a minute to a minute, a webpage will open in your default browser. If it does not happen, you can try to manually access `http://localhost:7860/`.
es: ***Paso 4*** | Aparecerá una terminal después de hacer doble clic en el archivo exe. Después de aproximadamente medio minuto a un minuto, se abrirá una página web en tu navegador predeterminado. Si esto no ocurre, puedes intentar acceder manualmente a `http://localhost:7860/`.

# chunk_E9C46195
source: > [!NOTE] > > If you encounter any issues during use WebUI, please refer to [this webpage](./USAGE_webui.md).
es: > [!NOTE] > > Si encuentras algún problema al usar WebUI, por favor consulta [esta página web](./USAGE_webui.md).

# chunk_703B946D
source: ***Step 5*** | Enjoy!
es: ***Paso 5*** | ¡Disfruta!

# chunk_BF8657F3
source: > [!TIP] > **You can use the .exe file via command line** > > Use the .exe file through command line as follows: > > - Launch your terminal and navigate to the folder containing the .exe file: > > ```bash > cd /path/pdf2zh_next/build > ``` > > - Call the .exe file: > > ```bash > ./pdf2zh_next.exe "document.pdf" > ``` > > You can use other command line parameters as normal: > > ```bash > ./pdf2zh_next.exe "document.pdf" --lang-in en --lang-out ja > ``` > > If you need more information about command line usage, please refer to this article.
es: > [!TIP] > **Puedes usar el archivo .exe mediante la línea de comandos** > > Usa el archivo .exe a través de la línea de comandos de la siguiente manera: > > - Abre tu terminal y navega hasta la carpeta que contiene el archivo .exe: > > ```bash > cd /path/pdf2zh_next/build > ``` > > - Llama al archivo .exe: > > ```bash > ./pdf2zh_next.exe "document.pdf" > ``` > > Puedes usar otros parámetros de línea de comandos como de costumbre: > > ```bash > ./pdf2zh_next.exe "document.pdf" --lang-in en --lang-out ja > ``` > > Si necesitas más información sobre el uso de la línea de comandos, consulta este artículo.

# chunk_1C59CC51
source: [**Getting Started**](./getting-started.md) > **Usage** > **Command Line** _(current)_
es: [**Empezar**](./getting-started.md) > **Uso** > **Línea de comandos** _(actual)_

# chunk_9C810511
source: ### Use PDFMathTranslate via command line
es: ### Usar PDFMathTranslate mediante la línea de comandos

# chunk_30052F3A
source: #### Basic Usage
es: #### Uso básico

# chunk_ACC119CF
source: After Installation, please enter this command to translate your PDF.
es: Después de la instalación, por favor ingrese este comando para traducir su PDF.

# chunk_744BFC94
source: > [!NOTE] > > If your pathname contains spaces, please enclose it in quotation marks. > > ```bash > pdf2zh_next "path with spaces/document.pdf" > ```
es: > [!NOTE] > > Si el nombre de la ruta contiene espacios, por favor enciérrelo entre comillas. > > ```bash > pdf2zh_next "path with spaces/document.pdf" > ```

# chunk_6375D505
source: After execute translation, files generated in **current working directory**.
es: Después de ejecutar la traducción, los archivos se generan en el **directorio de trabajo actual**.

# chunk_1E0F4B41
source: > [!TIP] > **Where is my "Current Working Directory" ?** > Before entering a command in the terminal, you might see a pathname displayed in your terminal: > > ```powershell > PS C:\Users\XXX> > ``` > > This directory is the "*Current working directory*." > > If there is no pathname, try running this command in the terminal: > > ```bash > pwd > ``` > > After executing this command, a pathname will be output. This pathname is the "**Current working directory**". The translated files will appear here.
es: > [!TIP] > **¿Dónde está mi "Directorio de trabajo actual"?** > Antes de ingresar un comando en la terminal, es posible que veas una ruta mostrada en tu terminal: > > ```powershell > PS C:\Users\XXX> > ``` > > Este directorio es el "*Directorio de trabajo actual*". > > Si no hay una ruta visible, intenta ejecutar este comando en la terminal: > > ```bash > pwd > ``` > > Después de ejecutar este comando, se mostrará una ruta. Esta ruta es el "**Directorio de trabajo actual**". Los archivos traducidos aparecerán aquí.

# chunk_67DBD505
source: #### Advance Usage
es: #### Opciones avanzadas

# chunk_98AF19D9
source: For detailed explanations of additional command line parameters, please refer to [advanced usage](./../advanced/advanced.md).
es: Para explicaciones detalladas de los parámetros adicionales de la línea de comandos, consulta [opciones avanzadas](./../advanced/advanced.md).

# chunk_03FD0E12
source: [**Getting Started**](./getting-started.md) > **Installation** > **WebUI** _(current)_
es: [**Empezar**](./getting-started.md) > **Instalación** > **WebUI** _(actual)_

# chunk_EDC72645
source: ### Use PDFMathTranslate via Webui
es: ### Usar PDFMathTranslate a través de Webui

# chunk_D75BD342
source: #### How to open the WebUI page:
es: #### Cómo abrir la página de WebUI:

# chunk_65E65B28
source: There are several methods to open the WebUI interface. If you are using **Windows**, please refer to [this article](./INSTALLATION_winexe.md);
es: Existen varios métodos para abrir la interfaz de WebUI. Si estás usando **Windows**, por favor consulta [este artículo](./INSTALLATION_winexe.md);

# chunk_2A12C8AD
source: 1. Python installed (3.10 <= version <= 3.12) 2. Install our package: 3. Start using in browser: ```bash pdf2zh_next --gui ``` 4. If your browswer has not been started automatically, goto ```bash http://localhost:7860/ ``` Drop the PDF file into the window and click `Translate`.
es: 1. Python instalado (versión 3.10 <= versión <= 3.12) 2. Instala nuestro paquete: 3. Comienza a usar en el navegador: ```bash pdf2zh_next --gui ``` 4. Si tu navegador no se ha iniciado automáticamente, ve a ```bash http://localhost:7860/ ``` Arrastra el archivo `PDF` a la ventana y haz clic en `Translate`.

# chunk_2FDC0409
source: ### Environment Variables
es: ### Variables de entorno

# chunk_7865A8EB
source: You can set the source and target languages using environment variables:
es: Puedes configurar los idiomas de origen y destino utilizando variables de entorno:

# chunk_104D91B6
source: - `PDF2ZH_LANG_FROM`: Sets the source language. Defaults to "English". - `PDF2ZH_LANG_TO`: Sets the target language. Defaults to "Simplified Chinese".
es: - `PDF2ZH_LANG_FROM`: Establece el idioma de origen. Por defecto es "English". - `PDF2ZH_LANG_TO`: Establece el idioma de destino. Por defecto es "Simplified Chinese".

# chunk_EEBEC547
source: ## Preview
es: ## Vista previa

# chunk_742C5FE6
source: ## Maintainance
es: ## Mantenimiento

# chunk_3D5EA421
source: GUI maintained by [Rongxin](https://github.com/reycn)
es: ### TRANSLATION GUI mantenido por [Rongxin](https://github.com/reycn)

# chunk_451D1544
source: ### Getting Started
es: ### Empezar

# chunk_5534569E
source: PDFMathTranslate is a powerful PDF translation tool. You can install and start using this tool in various ways.
es: PDFMathTranslate es una potente herramienta de traducción de PDF. Puedes instalar y comenzar a usar esta herramienta de varias formas.

# chunk_0CAD1479
source: 1. [**Windows EXE**](./INSTALLATION_winexe.md) <small>Recommand for Windows</small> 2. [**Docker**](./INSTALLATION_docker.md) <small>Recommand for Linux</small> 3. [**uv** (a Python package manager)](./INSTALLATION_uv.md) <small>Recommand for macOS</small>
es: 1. [**Windows EXE**](./INSTALLATION_winexe.md) <small>Recomendado para Windows</small> 2. [**Docker**](./INSTALLATION_docker.md) <small>Recomendado para Linux</small> 3. [**uv** (un gestor de paquetes Python)](./INSTALLATION_uv.md) <small>Recomendado para macOS</small>

# chunk_3E32AB82
source: 1. [Using **WebUI**](./USAGE_webui.md) 2. [Using **Zotero Plugin**](https://github.com/guaguastandup/zotero-pdf2zh) (Third party program) 3. [Using **Commandline**](./USAGE_commandline.md)
es: 1. [Usando **WebUI**](./USAGE_webui.md) 2. [Usando **Zotero Plugin**](https://github.com/guaguastandup/zotero-pdf2zh) (Programa de terceros) 3. [Usando **Línea de comandos**](./USAGE_commandline.md)

# chunk_C7A7730D
source: > [!NOTE] > Please [click here](https://funstory-ai.github.io/BabelDOC/supported_languages/) to navigate to the *BabelDOC Supported Language* page. The information there also applies to pdf2zh.
es: > [!NOTE] > Por favor, [haz clic aquí](https://funstory-ai.github.io/BabelDOC/supported_languages/) para navegar a la página de *Idiomas soportados por BabelDOC*. La información allí también se aplica a pdf2zh.
