Repository: zhenchuanpk2010/PDFMathTranslator
Catalog: docs/Contribute/*.po
Languages: es

# chunk_9CD70BC3
source: <h2 id="title">PDFMathTranslate</h2> <p>
es: <h2 id="titulo">PDFMathTranslate</h2> <p>

# chunk_C3623279
source: <a href="https://hellogithub.com/repository/8ec2cfd3ef744762bf531232fa32bc47" target="_blank"><img src="https://api.hellogithub.com/v1/widgets/recommend.svg?rid=8ec2cfd3ef744762bf531232fa32bc47&claim_uid=JQ0yfeBNjaTuqDU&theme=small" alt="Featured｜HelloGitHub" /></a>
es: <a href="https://hellogithub.com/repository/8ec2cfd3ef744762bf531232fa32bc47" target="_blank"><img src="https://api.hellogithub.com/v1/widgets/recommend.svg?rid=8ec2cfd3ef744762bf531232fa32bc47&claim_uid=JQ0yfeBNjaTuqDU&theme=small" alt="Destacado｜HelloGitHub" /></a>

# chunk_90458E01
source: </div> PDF scientific paper translation and bilingual comparison.
es: </div> Traducción de artículos científicos en PDF y comparación bilingüe.

# chunk_3BE38B9A
source: - 📊 Preserve formulas, charts, table of contents, and annotations _([preview](#preview))_. - 🌐 Support [multiple languages](https://pdf2zh-next.com/supported_languages.html), and diverse [translation services](https://pdf2zh-next.com/advanced/Documentation-of-Translation-Services.html). - 🤖 Provides [commandline tool](https://pdf2zh-next.com/getting-started/USAGE_commandline.html), [interactive user interface](https://pdf2zh-next.com/getting-started/USAGE_webui.html), and [Docker](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html)
es: - 📊 Conserva fórmulas, gráficos, tablas de contenido y anotaciones _([vista previa](#vista-previa))_. - 🌐 Soporta [múltiples idiomas](https://pdf2zh-next.com/supported_languages.html) y diversos [servicios de traducción](https://pdf2zh-next.com/advanced/Documentation-of-Translation-Services.html). - 🤖 Ofrece [herramienta de línea de comandos](https://pdf2zh-next.com/getting-started/USAGE_commandline.html), [interfaz de usuario interactiva](https://pdf2zh-next.com/getting-started/USAGE_webui.html) y [Docker](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html)

# chunk_66808EE3
source: > [!WARNING] > > This project is provided "as is" under the [AGPL v3](https://github.com/PDFMathTranslate/PDFMathTranslate-next/blob/main/LICENSE) license, and no guarantees are provided for the quality and performance of the program. **The entire risk of the program's quality and performance is borne by you.** If the program is found to be defective, you will be responsible for all necessary service, repair, or correction costs. > > Due to the maintainers' limited energy, we do not provide any form of usage assistance or problem-solving. Related issues will be closed directly! (Pull requests to improve project documentation are welcome; bugs or friendly issues that follow the issue template are not affected by this)
es: > [!WARNING] > > Este proyecto se proporciona "tal cual" bajo la licencia [AGPL v3](https://github.com/PDFMathTranslate/PDFMathTranslate-next/blob/main/LICENSE), y no se ofrecen garantías sobre la calidad y el rendimiento del programa. **Tú asumes todo el riesgo relacionado con la calidad y el rendimiento del programa.** Si se encuentra que el programa es defectuoso, serás responsable de todos los costos necesarios de servicio, reparación o corrección. > > Debido a la energía limitada de los mantenedores, no proporcionamos ningún tipo de asistencia de uso o resolución de problemas. ¡Los problemas relacionados se cerrarán directamente! (Se agradecen las solicitudes de extracción para mejorar la documentación del proyecto; los errores o problemas amigables que sigan la plantilla de problemas no se ven afectados por esto)

# chunk_E0B1FBFE
source: For details on how to contribute, please consult the [Contribution Guide](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="updates">Updates</h2>
es: Para más detalles sobre cómo contribuir, por favor consulta la [Guía de Contribución](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="actualizaciones">Actualizaciones</h2>

# chunk_5E68D02E
source: - [Jun. 4, 2025] The project is renamed and move to [PDFMathTranslate/PDFMathTranslate-next](https://github.com/PDFMathTranslate/PDFMathTranslate-next) (by [@awwaawwa](https://github.com/awwaawwa)) - [Mar. 3, 2025] Experimental support for the new backend [BabelDOC](https://github.com/funstory-ai/BabelDOC) WebUI added as an experimental option (by [@awwaawwa](https://github.com/awwaawwa)) - [Feb. 22 2025] Better release CI and well-packaged windows-amd64 exe (by [@awwaawwa](https://github.com/awwaawwa)) - [Dec. 24 2024] The translator now supports local models on [Xinference](https://github.com/xorbitsai/inference) _(by [@imClumsyPanda](https://github.com/imClumsyPanda))_ - [Dec. 19 2024] Non-PDF/A documents are now supported using `-cp` _(by [@reycn](https://github.com/reycn))_ - [Dec. 13 2024] Additional support for backend by _(by [@YadominJinta](https://github.com/YadominJinta))_ - [Dec. 10 2024] The translator now supports OpenAI models on Azure _(by [@yidasanqian](https://github.com/yidasanqian))_
es: - [4 de junio de 2025] El proyecto ha sido renombrado y trasladado a [PDFMathTranslate/PDFMathTranslate-next](https://github.com/PDFMathTranslate/PDFMathTranslate-next) (por [@awwaawwa](https://github.com/awwaawwa)) - [3 de marzo de 2025] Soporte experimental para el nuevo backend [BabelDOC](https://github.com/funstory-ai/BabelDOC) WebUI añadido como una opción experimental (por [@awwaawwa](https://github.com/awwaawwa)) - [22 de febrero de 2025] Mejor CI de lanzamiento y ejecutable windows-amd64 bien empaquetado (por [@awwaawwa](https://github.com/awwaawwa)) - [24 de diciembre de 2024] El traductor ahora soporta modelos locales en [Xinference](https://github.com/xorbitsai/inference) _(por [@imClumsyPanda](https://github.com/imClumsyPanda))_ - [19 de diciembre de 2024] Ahora se soportan documentos que no son PDF/A usando `-cp` _(por [@reycn](https://github.com/reycn))_ - [13 de diciembre de 2024] Soporte adicional para backend por _(por [@YadominJinta](https://github.com/YadominJinta))_ - [10 de diciembre de 2024] El traductor ahora soporta modelos de OpenAI en Azure _(por [@yidasanqian](https://github.com/yidasanqian))_

# chunk_2B22A264
source: <h2 id="preview">Preview</h2> <div align="center">
es: <h2 id="vista-previa">Vista previa</h2> <div align="center">

# chunk_EBDB9E88
source: </div> <h2 id="demo">Online Service 🌟</h2>
es: </div> <h2 id="demo">Servicio en línea 🌟</h2>

# chunk_3723C881
source: > [!NOTE] > > pdf2zh 2.0 does not currently provide an online demo
es: > [!NOTE] > > pdf2zh 2.0 actualmente no ofrece una demostración en línea

# chunk_1F3D6D5D
source: You can try our application out using either of the following demos:
es: Puedes probar nuestra aplicación utilizando cualquiera de las siguientes demostraciones:

# chunk_B617543E
source: - [v1.x Public free service](https://pdf2zh.com/) online without installation _(recommended)_. - [Immersive Translate - BabelDOC](https://app.immersivetranslate.com/babel-doc/) 1000 free pages per month. _(recommended)_
es: - [Servicio público gratuito v1.x](https://pdf2zh.com/) en línea sin instalación _(recomendado)_. - [Immersive Translate - BabelDOC](https://app.immersivetranslate.com/babel-doc/) 1000 páginas gratuitas al mes. _(recomendado)_

# chunk_FDDD972D
source: Note that the computing resources of the demo are limited, so please avoid abusing them. <h2 id="install">Installation and Usage</h2>
es: Ten en cuenta que los recursos de computación de la demo son limitados, así que evita abusar de ellos. <h2 id="install">Instalación y Uso</h2>

# chunk_36D1B1ED
source: ### Installation
es: ### Instalación

# chunk_545A02FF
source: 1. [**Windows EXE**](https://pdf2zh-next.com/getting-started/INSTALLATION_winexe.html) <small>Recommand for Windows</small> 2. [**Docker**](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html) <small>Recommand for Linux</small> 3. [**uv** (a Python package manager)](https://pdf2zh-next.com/getting-started/INSTALLATION_uv.html) <small>Recommand for macOS</small>
es: 1. [**Windows EXE**](https://pdf2zh-next.com/getting-started/INSTALLATION_winexe.html) <small>Recomendado para Windows</small> 2. [**Docker**](https://pdf2zh-next.com/getting-started/INSTALLATION_docker.html) <small>Recomendado para Linux</small> 3. [**uv** (un gestor de paquetes de Python)](https://pdf2zh-next.com/getting-started/INSTALLATION_uv.html) <small>Recomendado para macOS</small>

# chunk_047D6F23
source: ### Usage
es: ### Uso

# chunk_A49D7830
source: 1. [Using **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) 2. [Using **Zotero Plugin**](https://github.com/guaguastandup/zotero-pdf2zh) (Third party program) 3. [Using **Commandline**](https://pdf2zh-next.com/getting-started/USAGE_commandline.html)
es: 1. [Usando **WebUI**](https://pdf2zh-next.com/getting-started/USAGE_webui.html) 2. [Usando **Plugin de Zotero**](https://github.com/guaguastandup/zotero-pdf2zh) (Programa de terceros) 3. [Usando **Línea de comandos**](https://pdf2zh-next.com/getting-started/USAGE_commandline.html)

# chunk_F57A3EE5
source: For different use cases, we provide distinct methods to use our program. Check out [this page](./getting-started/getting-started.md) for more information. <h2 id="usage">Advanced Options</h2> For detailed explanations, please refer to our document about [Advanced Usage](https://pdf2zh-next.com/advanced/advanced.html) for a full list of each option. <h2 id="downstream">Secondary Development (APIs)</h2>
es: Para diferentes casos de uso, proporcionamos distintos métodos para utilizar nuestro programa. Consulta [esta página](./getting-started/getting-started.md) para obtener más información. <h2 id="usage">Opciones avanzadas</h2> Para explicaciones detalladas, consulta nuestro documento sobre [Uso avanzado](https://pdf2zh-next.com/advanced/advanced.html) para obtener una lista completa de cada opción. <h2 id="downstream">Desarrollo secundario (APIs)</h2>

# chunk_DF45699B
source: > [!NOTE] > > Currently, no relevant documentation is provided. It will be supplemented later. Please wait patiently.
es: > [!NOTE] > > Actualmente, no se proporciona documentación relevante. Se complementará más adelante. Por favor, espere pacientemente.

# chunk_FAB5C5B4
source: <h2 id="langcode">Language Code</h2> If you don't know what code to use to translate to the language you need, check out [this documentation](https://pdf2zh-next.com/advanced/Language-Codes.html)
es: <h2 id="codigodeidioma">Código de idioma</h2> Si no sabes qué código usar para traducir al idioma que necesitas, consulta [esta documentación](https://pdf2zh-next.com/advanced/Language-Codes.html)

# chunk_AD3429B4
source: <h2 id="acknowledgement">Acknowledgements</h2>
es: <h2 id="reconocimientos">Reconocimientos</h2>

# chunk_C0AB99E6
source: - [Immersive Translation](https://immersivetranslate.com) sponsors monthly Pro membership redemption codes for active contributors to this project, see details at: [CONTRIBUTOR_REWARD.md](https://github.com/funstory-ai/BabelDOC/blob/main/docs/CONTRIBUTOR_REWARD.md) - [SiliconFlow](https://siliconflow.cn) provides a free translation service for this project, powered by large language models (LLMs). - 1.x version: [Byaidu/PDFMathTranslate](https://github.com/Byaidu/PDFMathTranslate) - backend: [BabelDOC](https://github.com/funstory-ai/BabelDOC) - PDF Library: [PyMuPDF](https://github.com/pymupdf/PyMuPDF) - PDF Parsing: [Pdfminer.six](https://github.com/pdfminer/pdfminer.six) - PDF Preview: [Gradio PDF](https://github.com/freddyaboulton/gradio-pdf) - Layout Parsing: [DocLayout-YOLO](https://github.com/opendatalab/DocLayout-YOLO) - PDF Standards: [PDF Explained](https://zxyle.github.io/PDF-Explained/), [PDF Cheat Sheets](https://pdfa.org/resource/pdf-cheat-sheets/) - Multilingual Font: see [BabelDOC-Assets](https://github.com/funstory-ai/BabelDOC-Assets) - [Asynchronize](https://github.com/multimeric/Asynchronize/tree/master?tab=readme-ov-file) - [Rich logging with multiprocessing](https://github.com/SebastianGrans/Rich-multiprocess-logging/tree/main) - Documentation i18n using [Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/)
es: - [Immersive Translation](https://immersivetranslate.com) patrocina códigos de canje mensuales para membresía Pro para contribuyentes activos de este proyecto, consulta los detalles en: [CONTRIBUTOR_REWARD.md](https://github.com/funstory-ai/BabelDOC/blob/main/docs/CONTRIBUTOR_REWARD.md) - [SiliconFlow](https://siliconflow.cn) proporciona un servicio de traducción gratuito para este proyecto, impulsado por modelos de lenguaje grandes (LLMs). - Versión 1.x: [Byaidu/PDFMathTranslate](https://github.com/Byaidu/PDFMathTranslate) - backend: [BabelDOC](https://github.com/funstory-ai/BabelDOC) - Biblioteca PDF: [PyMuPDF](https://github.com/pymupdf/PyMuPDF) - Análisis de PDF: [Pdfminer.six](https://github.com/pdfminer/pdfminer.six) - Vista previa de PDF: [Gradio PDF](https://github.com/freddyaboulton/gradio-pdf) - Análisis de diseño: [DocLayout-YOLO](https://github.com/opendatalab/DocLayout-YOLO) - Estándares PDF: [PDF Explained](https://zxyle.github.io/PDF-Explained/), [PDF Cheat Sheets](https://pdfa.org/resource/pdf-cheat-sheets/) - Fuente multilingüe: consulta [BabelDOC-Assets](https://github.com/funstory-ai/BabelDOC-Assets) - [Asynchronize](https://github.com/multimeric/Asynchronize/tree/master?tab=readme-ov-file) - [Registro enriquecido con multiprocesamiento](https://github.com/SebastianGrans/Rich-multiprocess-logging/tree/main) - Documentación i18n utilizando [Weblate](https://hosted.weblate.org/projects/pdfmathtranslate-next/)

# chunk_5DD24D41
source: <h2 id="conduct">Before submit your code</h2> We welcome the active participation of contributors to make pdf2zh better. Before you are ready to submit your code, please refer to our [Code of Conduct](https://pdf2zh-next.com/community/CODE_OF_CONDUCT.html) and [Contribution Guide](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="contrib">Contributors</h2> <a href="https://github.com/PDFMathTranslate/PDFMathTranslate-next/graphs/contributors">
es: <h2 id="conduct">Antes de enviar tu código</h2> Agradecemos la participación activa de los contribuyentes para mejorar pdf2zh. Antes de que estés listo para enviar tu código, por favor consulta nuestro [Código de Conducta](https://pdf2zh-next.com/community/CODE_OF_CONDUCT.html) y [Guía de Contribución](https://pdf2zh-next.com/community/Contribution-Guide.html). <h2 id="contrib">Contribuyentes</h2> <a href="https://github.com/PDFMathTranslate/PDFMathTranslate-next/graphs/contributors">

# chunk_61BE03EB
source: <h2 id="star_hist">Star History</h2> <a href="https://star-history.com/#PDFMathTranslate/PDFMathTranslate-next&Date"> <picture> <source media="(prefers-color-scheme: dark)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate/PDFMathTranslate-next&type=Date&theme=dark" /> <source media="(prefers-color-scheme: light)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate/PDFMathTranslate-next&type=Date" />
es: <h2 id="historial_de_estrellas">Historial de estrellas</h2> <a href="https://star-history.com/#PDFMathTranslate/PDFMathTranslate-next&Date"> <picture> <source media="(prefers-color-scheme: dark)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate/PDFMathTranslate-next&type=Date&theme=dark" /> <source media="(prefers-color-scheme: light)" srcset="https://api.star-history.com/svg?repos=PDFMathTranslate/PDFMathTranslate-next&type=Date" />

# chunk_F2495A85
source: > [!CAUTION] > > This document is outdated, please do not refer to it.
es: > [!CAUTION] > > Este documento está desactualizado, por favor no lo consultes.

# chunk_3CA8722C
source: <h2 id="toc">Table of Content</h2> The present project supports two types of APIs, All methods need the Redis;
es: <h2 id="toc">Tabla de contenido</h2> El presente proyecto soporta dos tipos de APIs, todos los métodos necesitan Redis;

# chunk_AE8C8A31
source: - [Functional calls in Python](#api-python) - [HTTP protocols](#api-http)
es: - [Llamadas funcionales en Python](#api-python) - [Protocolos HTTP](#api-http)

# chunk_1C2FD3FE
source: <h2 id="api-python">Python</h2> As `pdf2zh` is an installed module in Python, we expose two methods for other programs to call in any Python scripts. For example, if you want translate a document from English to Chinese using Google Translate, you may use the following code:
es: <h2 id="api-python">Python</h2> Como `pdf2zh` es un módulo instalado en Python, exponemos dos métodos para que otros programas puedan llamar en cualquier script de Python. Por ejemplo, si deseas traducir un documento del inglés al chino usando Google Translate, puedes usar el siguiente código:

# chunk_2DB09B71
source: Translate with files:
es: Traducir con archivos:

# chunk_8C07F04C
source: Translate with stream:
es: Traducir con transmisión:

# chunk_F1B6ECA2
source: [⬆️ Back to top](#toc)
es: [⬆️ Volver arriba](#toc)

# chunk_F96246D5
source: <h2 id="api-http">HTTP</h2> In a more flexible way, you can communicate with the program using HTTP protocols, if:
es: <h2 id="api-http">HTTP</h2> De una manera más flexible, puedes comunicarte con el programa utilizando protocolos HTTP, si:

# chunk_5C9E9558
source: 1. Install and run backend ```bash pip install pdf2zh_next[backend] pdf2zh_next --flask pdf2zh_next --celery worker ``` 2. Using HTTP protocols as follows: - Submit translate task ```bash curl http://localhost:11008/v1/translate -F "file=@example.pdf" -F "data={\"lang_in\":\"en\",\"lang_out\":\"zh\",\"service\":\"google\",\"thread\":4}" {"id":"d9894125-2f4e-45ea-9d93-1a9068d2045a"} ``` - Check Progress ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a {"info":{"n":13,"total":506},"state":"PROGRESS"} ``` - Check Progress _(if finished)_ ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a {"state":"SUCCESS"} ``` - Save monolingual file ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a/mono --output example-mono.pdf ``` - Save bilingual file ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a/dual --output example-dual.pdf ``` - Interrupt if running and delete the task ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a -X DELETE ```
es: 1. Instalar y ejecutar el backend ```bash pip install pdf2zh_next[backend] pdf2zh_next --flask pdf2zh_next --celery worker ``` 2. Usar los protocolos HTTP de la siguiente manera: - Enviar tarea de traducción ```bash curl http://localhost:11008/v1/translate -F "file=@example.pdf" -F "data={\"lang_in\":\"en\",\"lang_out\":\"zh\",\"service\":\"google\",\"thread\":4}" {"id":"d9894125-2f4e-45ea-9d93-1a9068d2045a"} ``` - Verificar progreso ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a {"info":{"n":13,"total":506},"state":"PROGRESS"} ``` - Verificar progreso _(si está completado)_ ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a {"state":"SUCCESS"} ``` - Guardar archivo monolingüe ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a/mono --output example-mono.pdf ``` - Guardar archivo bilingüe ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a/dual --output example-dual.pdf ``` - Interrumpir si está en ejecución y eliminar la tarea ```bash curl http://localhost:11008/v1/translate/d9894125-2f4e-45ea-9d93-1a9068d2045a -X DELETE ```

# chunk_D4E24BCF
source: # Contributor Covenant Code of Conduct
es: # Código de Conducta del Pacto del Contribuyente

# chunk_18B00C61
source: ## Our Pledge
es: ## Nuestro Compromiso

# chunk_49BBC232
source: We as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for everyone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity and expression, level of experience, education, socio-economic status, nationality, personal appearance, race, religion, or sexual identity and orientation. We pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community.
es: Nosotros, como miembros, colaboradores y líderes, nos comprometemos a hacer que la participación en nuestra comunidad sea una experiencia libre de acoso para todos, independientemente de la edad, el tamaño corporal, la discapacidad visible o invisible, la etnia, las características sexuales, la identidad y expresión de género, el nivel de experiencia, la educación, el estatus socioeconómico, la nacionalidad, la apariencia personal, la raza, la religión, o la identidad y orientación sexual. Nos comprometemos a actuar e interactuar de maneras que contribuyan a una comunidad abierta, acogedora, diversa, inclusiva y saludable.

# chunk_45AD4A2F
source: ## Our Standards
es: ## Nuestros estándares

# chunk_131B12AA
source: Examples of behavior that contributes to a positive environment for our community include:
es: Ejemplos de comportamiento que contribuyen a un entorno positivo para nuestra comunidad incluyen:

# chunk_8C8AA428
source: * Demonstrating empathy and kindness toward other people * Being respectful of differing opinions, viewpoints, and experiences * Giving and gracefully accepting constructive feedback * Accepting responsibility and apologizing to those affected by our mistakes, and learning from the experience * Focusing on what is best not just for us as individuals, but for the overall community
es: * Demostrar empatía y amabilidad hacia otras personas * Ser respetuoso con las diferentes opiniones, puntos de vista y experiencias * Dar y aceptar con gracia comentarios constructivos * Aceptar la responsabilidad y disculparse con aquellos afectados por nuestros errores, y aprender de la experiencia * Centrarse en lo que es mejor no solo para nosotros como individuos, sino para la comunidad en general

# chunk_9D3CC4B6
source: Examples of unacceptable behavior include:
es: Ejemplos de comportamiento inaceptable incluyen:

# chunk_06867E28
source: * The use of sexualized language or imagery, and sexual attention or advances of any kind * Trolling, insulting or derogatory comments, and personal or political attacks * Public or private harassment * Publishing others' private information, such as a physical or email address, without their explicit permission * Other conduct which could reasonably be considered inappropriate in a professional setting
es: * El uso de lenguaje o imágenes sexualizadas, y atención o avances sexuales de cualquier tipo * Comentarios de troleo, insultos o despectivos, y ataques personales o políticos * Acoso público o privado * Publicar información privada de otros, como una dirección física o de correo electrónico, sin su permiso explícito * Otros comportamientos que razonablemente podrían considerarse inapropiados en un entorno profesional

# chunk_F1541146
source: ## Enforcement Responsibilities
es: ## Responsabilidades de Aplicación
